[
    {
        "id": 5252,
        "tags": [
            "Stock Performance",
            "Bullish"
        ],
        "body": "PT HM Sampoerna Tbk (HMSP) stock has risen 31% from its lowest point of IDR 496 on April 8, 2025, to IDR 650 on Wednesday. Despite this increase, the stock is still down 12.16% compared to the same period last year.",
        "source": "https://insight.kontan.co.id/news/hmsp-naik-31-sejak-awal-april-2025-simak-analisis-teknikal-dan-rekomendasi-sahamnya",
        "timestamp": "2025-06-05T07:36:00"
    },
    {
        "id": 5253,
        "tags": [
            "Debt",
            "Repayment",
            "Government",
            "Bonds",
            "State Budget",
            "Bearish"
        ],
        "body": "The Indonesian government is expected to face a significant increase in debt repayment obligations in June 2025, with State Bond Notes (SBN) worth Rp 178.9 trillion due for repayment. This amount is the highest compared to other months in 2025, with SBN repayments in May and July amounting to Rp 42.4 trillion and Rp 34.7 trillion, respectively.",
        "source": "https://insight.kontan.co.id/news/bersiap-hadapi-lonjakan-utang-jatuh-tempo",
        "timestamp": "2025-06-05T07:06:00"
    },
    {
        "id": 5254,
        "tags": [
            "Private Placement",
            "Capital Increase",
            "Stock Performance",
            "Neutral"
        ],
        "body": "PT Fast Food Indonesia Tbk, the operator of KFC restaurants, has raised capital through a private placement, issuing 533.33 million new shares at IDR 150 per share. The move is seen as a response to the current volatile stock market conditions.",
        "source": "https://insight.kontan.co.id/news/emiten-ramai-menambah-modal-lewat-private-placement",
        "timestamp": "2025-06-05T06:20:00"
    },
    {
        "id": 5255,
        "tags": [
            "Distribution",
            "Collaboration",
            "Sales",
            "Bullish"
        ],
        "body": "PT Buyung Poetra Sembada Tbk (BPOETRA) aims to increase sales by maximizing synergy between its distribution networks, as seen in its collaboration with Hoki and Indomarco at the National Sales Kickoff event in Jakarta, which will expand Hoki's product reach to various segments of Indonesian society. This strategy is expected to enhance the company's market penetration capabilities.",
        "source": "https://insight.kontan.co.id/news/kerek-penjualan-buyung-poetra-sembada-hoki-gandeng-salim-group",
        "timestamp": "2025-06-05T06:15:00"
    },
    {
        "id": 5266,
        "tags": [
            "Government",
            "Transportation",
            "Economic Growth",
            "Bullish"
        ],
        "body": "PT Kereta Api Indonesia (KAI) has launched a 30% discount program to support national economic growth in the transportation sector. The program is part of the government's stimulus package to maintain people's purchasing power and encourage economic growth.",
        "source": "https://insight.kontan.co.id/news/kai-memberi-diskon-30-untuk-53-rute-ekonomi",
        "timestamp": "2025-06-05T06:05:00"
    },
    {
        "id": 5268,
        "tags": [
            "Foreign Exchange Rates",
            "Rupiah",
            "Bullish"
        ],
        "body": "The Indonesian rupiah strengthened 0.09% against the US dollar on Wednesday, reaching Rp 16,295 per dollar, driven by a combination of global and domestic sentiments, including the impact of President Donald Trump's tariffs on steel and aluminum. The rupiah's strengthening was also reflected in the Jisdor Bank Indonesia rate, which weakened 0.10% to Rp 16,305 per dollar.",
        "source": "https://insight.kontan.co.id/news/rupiah-bisa-menguat-terbatas-pada-kamis-56",
        "timestamp": "2025-06-05T06:00:00"
    },
    {
        "id": 5269,
        "tags": [
            "Acquisition",
            "Expansion",
            "Subsidiaries",
            "Neutral"
        ],
        "body": "Daewoong Bio Indonesia, a subsidiary of South Korea-based Daewoong Group, has acquired PT Wietasha Putrindowisata, owner and operator of Alam Kulkul Boutique Resort in Kuta, Bali, to expand into the hospitality sector. The acquisition aims to transform the resort into a wellness-focused destination with a symposium center.",
        "source": "https://insight.kontan.co.id/news/daewoong-akuisisi-alam-kulkul-boutique-resort",
        "timestamp": "2025-06-05T06:00:00"
    },
    {
        "id": 5267,
        "tags": [
            "Dividends",
            "Cash Flow",
            "Net Profit",
            "Bullish"
        ],
        "body": "PT Mitra Keluarga Karyasehat Tbk (Mika) will distribute a cash dividend of IDR 43 per share, equivalent to 52.2% of its net profit last year, following approval from its annual general meeting of shareholders. The dividend payment will be made within 30 days after the announcement of the RUPST results.",
        "source": "https://insight.kontan.co.id/news/laba-meningkat-rs-mitra-keluarga-mika-menebar-dividen-tunai-rp-43-per-saham",
        "timestamp": "2025-06-05T06:00:00"
    },
    {
        "id": 5270,
        "tags": [
            "IDX",
            "Market Sentiment",
            "Neutral"
        ],
        "body": "The Indonesian stock index rose 0.34% to 7,069.04 on Wednesday, with technical indicators suggesting a potential short-term correction. However, if the index can hold above the 20-day moving average of around 7,038, there is a possibility of a continued rebound.",
        "source": "https://insight.kontan.co.id/news/menjelang-long-weekend-idul-adha-waspadai-aksi-ambil-untung-hari-ini-kamis-56",
        "timestamp": "2025-06-05T05:45:00"
    },
    {
        "id": 5271,
        "tags": [
            "Sharia Economy",
            "Asset Management",
            "Bearish"
        ],
        "body": "Indonesia's sharia banking market has shown little growth in recent years, with assets reaching IDR 936.2 trillion as of March 2025, accounting for only 7.35% of the total banking industry assets. The market share has only slightly increased from 6.47% in 2020, prompting regulators to continue pushing for consolidation among industry players.",
        "source": "https://insight.kontan.co.id/news/bsi-masih-perkasa-konsolidasi-jadi-kunci-lahirnya-penantang-baru",
        "timestamp": "2025-06-05T05:45:00"
    },
    {
        "id": 5272,
        "tags": [
            "Downstream",
            "Factory",
            "Expansion",
            "Project",
            "Bullish"
        ],
        "body": "PT Arsari Tambang, a mining company owned by Hashim Djojohadikusumo, brother of Indonesian President Prabowo Subianto, is set to launch a tin solder factory in Batam by July 2025 through its subsidiary PT Solder Tin Andalan Indonesia. The new factory will contribute to the country's mining downstreaming project.",
        "source": "https://insight.kontan.co.id/news/pabrik-timah-milik-hashim-siap-berproduksi-juli-2025",
        "timestamp": "2025-06-05T05:40:00"
    },
    {
        "id": 5222,
        "tags": [
            "Gold",
            "Bearish"
        ],
        "body": "Logam Mulia's certified gold price decreased by IDR 16,000 per gram to IDR 1,924,000 per gram, while the buyback price also dropped by IDR 000 per gram to IDR 1,768,000 per gram.",
        "source": "https://insight.kontan.co.id/news/profit-3106-setahun-harga-emas-antam-hari-ini-melemah-4-juni-2025",
        "timestamp": "2025-06-04T09:26:00"
    },
    {
        "id": 5223,
        "tags": [
            "BUMN",
            "Balance Sheet",
            "Restructuring",
            "Capital Restructuring",
            "Bullish"
        ],
        "body": "PT Bumi Resources Tbk (BUMI) has obtained permission to reorganize its financial balance sheet, allowing it to show a profit without being burdened by past deficits. The company received approval at its annual general meeting of shareholders and extraordinary general meeting of shareholders on Monday.",
        "source": "https://insight.kontan.co.id/news/bumi-menggaet-restu-lakukan-kuasi-organisasi-begini-dampaknya",
        "timestamp": "2025-06-04T08:12:00"
    },
    {
        "id": 5224,
        "tags": [
            "Government",
            "PLN",
            "Tariff",
            "Neutral"
        ],
        "body": "The Indonesian government has cancelled the planned discount on PLN tariffs, instead increasing the allocation for wage subsidies from IDR 150,000 to IDR 300,000 per month. The government had previously announced plans to provide economic stimulus, including a discount on PLN tariffs.",
        "source": "https://insight.kontan.co.id/news/komunikasi",
        "timestamp": "2025-06-04T06:13:00"
    },
    {
        "id": 5226,
        "tags": [
            "Manufacturing",
            "Renewable Energy",
            "Bullish"
        ],
        "body": "Badan Pengelola Investasi Daya Anagata Nusantara, the sovereign wealth fund of Indonesia, plans to invest $5 billion by 2025, focusing on themes such as hilirisasi, food security, energy security, manufacturing, and renewable energy. The fund's Managing Director, Danantara Arief Budiman, announced the investment target.",
        "source": "https://insight.kontan.co.id/news/danantara-siapkan-investasi-us-5-miliar-tahun-ini",
        "timestamp": "2025-06-04T06:05:00"
    },
    {
        "id": 5225,
        "tags": [
            "Dividends",
            "Shareholder Value",
            "Bullish"
        ],
        "body": "PT Medco Energi Internasional Tbk (MEDC) has received approval from its Annual General Meeting of Shareholders to distribute dividends for the 2024 fiscal year, totaling $63.29 million. The company will proceed with the dividend distribution to its shareholders.",
        "source": "https://insight.kontan.co.id/news/dapat-restu-rupst-medco-energi-medc-bagi-dividen-us-6329-juta",
        "timestamp": "2025-06-04T06:05:00"
    },
    {
        "id": 5227,
        "tags": [
            "IDX",
            "IHSG",
            "Bearish"
        ],
        "body": "The Jakarta Composite Index (IHSG) closed 0.28% lower at 7,044.82 on Tuesday, with foreign investors recording a net sell of IDR 736.24 billion. Analysts recommend Golden Energy Mines (GEM) at IDR 9,375.",
        "source": "https://insight.kontan.co.id/news/tren-asing-kembali-melakukan-net-sell-simak-rekomendasi-saham-hari-ini-rabu-46",
        "timestamp": "2025-06-04T05:46:00"
    },
    {
        "id": 5228,
        "tags": [
            "Foreign Exchange Rates",
            "Currency",
            "Bearish"
        ],
        "body": "Most Asian currencies weakened against the US dollar, with only the Japanese yen, Thai baht, and Chinese yuan strengthening in the past week, according to Bloomberg data. The currencies are sensitive to US President Donald Trump's tariff policy and geopolitical tensions.",
        "source": "https://insight.kontan.co.id/news/inkonsistensi-tarif-bikin-volatilitas-valas-asia-tinggi",
        "timestamp": "2025-06-04T05:45:00"
    },
    {
        "id": 5229,
        "tags": [
            "Rubber",
            "Economic Growth",
            "Bullish"
        ],
        "body": "The Indonesian tire industry is expected to see growth in production and sales volumes, according to the Indonesian Tire Association and the Indonesian Rubber Council, despite concerns over weakening consumer purchasing power amid economic pressures.",
        "source": "https://insight.kontan.co.id/news/ekspansi-mobil-listrik-memacu-bisnis-ban",
        "timestamp": "2025-06-04T05:40:00"
    },
    {
        "id": 5230,
        "tags": [
            "IPO",
            "Dividends",
            "IDX",
            "Bullish"
        ],
        "body": "PT Adaro Minerals Indonesia Tbk (ADMR) will distribute $120 million, or approximately IDR 1.95 trillion, in dividends, marking its first dividend payout since its initial public offering in January 2022). The dividend distribution has received approval from the company's annual general meeting of shareholders.",
        "source": "https://insight.kontan.co.id/news/cuan-dividen-jumbo-emiten-grup-adro",
        "timestamp": "2025-06-04T05:35:00"
    },
    {
        "id": 5231,
        "tags": [
            "Revenue",
            "Earnings Report",
            "Financial Ratios",
            "IDX",
            "Bullish"
        ],
        "body": "PT GoTo Gojek Tokopedia TBK (GOTO) reported a 4.1% year-over-year (YoY) increase in transaction value to IDR 144.6 trillion, with net revenue increasing 40.4% YoY to IDR 4.3 trillion in Q1 2025.",
        "source": "https://insight.kontan.co.id/news/perbaikan-kinerja-menjadi-amunisi-goto-gojek-tokopedia-tbk-goto",
        "timestamp": "2025-06-04T05:30:00"
    },
    {
        "id": 5232,
        "tags": [
            "Dividends",
            "Net Profit",
            "Bullish"
        ],
        "body": "PT Pertamina Geothermal Energy Tbk (PGEOTH) has approved a dividend payout of $136.4 million from its 2024 net profit of $160.3 million, with the remaining $24 million retained as earnings. The company's annual general meeting of shareholders was held on Tuesday.",
        "source": "https://insight.kontan.co.id/news/pertamina-geothermal-pgeo-sebar-dividen-us-1364-juta-dan-genjot-produksi",
        "timestamp": "2025-06-04T05:05:00"
    },
    {
        "id": 5233,
        "tags": [
            "Economic Growth",
            "Economic Reports",
            "Bearish"
        ],
        "body": "Indonesia's economic slowdown, projected until 2026, has led to a rise in unemployment, with 7.28 million people unemployed as of February 2025, with over 65% of them being educated individuals. The country's education system has failed to address the needs of the workforce, with over 60% of workers employed in fields unrelated to their academic background.",
        "source": "https://insight.kontan.co.id/news/vokasi-mesin-pertumbuhan-ekonomi",
        "timestamp": "2025-06-04T05:02:00"
    },
    {
        "id": 5235,
        "tags": [
            "Financing",
            "Loan",
            "Government",
            "Bearish"
        ],
        "body": "The Indonesian government's subsidized loan program for micro, small, and medium enterprises has failed to meet its target, with only 36% of the Rp 300 trillion target achieved as of May 2025. The program, which offers lower interest rates than non-subsidized loans, is crucial for boosting credit to these enterprises.",
        "source": "https://insight.kontan.co.id/news/penyaluran-kur-di-awal-tahun-belum-maksimal",
        "timestamp": "2025-06-04T05:00:00"
    },
    {
        "id": 5234,
        "tags": [
            "Gold",
            "Bullish"
        ],
        "body": "The gold price is projected to continue its upward trend, with a current spot price of $3,382.80 per ounce, and Antam's gold price increasing by 1.83% to IDR 1,94 million per gram. Bloomberg data shows the gold price has risen 2.47% from the start of the week.",
        "source": "https://insight.kontan.co.id/news/diversifikasi-safe-haven-harga-emas-meningkat",
        "timestamp": "2025-06-04T05:00:00"
    },
    {
        "id": 5236,
        "tags": [
            "Financing",
            "Bearish"
        ],
        "body": "The multifinance industry's outstanding financing grew only 3.67% in April 2025, a significant decrease from 4.60% in March. This marks the 11th consecutive month of slowing growth since June 2024.",
        "source": "https://insight.kontan.co.id/news/masa-paceklik-kian-mencekik-multifinance",
        "timestamp": "2025-06-04T04:55:00"
    },
    {
        "id": 5247,
        "tags": [
            "Digital Ecosystem",
            "Partnership",
            "Fintech",
            "Financing",
            "Bullish"
        ],
        "body": "OCBC Indonesia has partnered with Ant International to deliver embedded financial services to small and medium-sized enterprises (SMEs), aiming to benefit thousands of small businesses in Indonesia over the next few years. The partnership will utilize Ant International's alternative-data modelling, credit strategy, and automated credit decision capabilities to offer differentiated services to SMEs within digital ecosystems.",
        "source": "https://asianbankingandfinance.net/cards-payments/news/ocbc-ant-intt-deliver-embedded-financial-services-indonesian-smes",
        "timestamp": "2025-06-04T04:51:50"
    },
    {
        "id": 5237,
        "tags": [
            "Bank Indonesia",
            "Domestic Investor",
            "Foreign Investment",
            "CAR",
            "Bullish"
        ],
        "body": "Several Indonesian banks, including Bank JTrust Indonesia and Bank Maspion Indonesia, have yet to meet the free float regulation, while Bank Mayapada's capital adequacy ratio stands at a minimum of 10.47% as of March 2025, potentially attracting new investors from both domestic and foreign sources.",
        "source": "https://insight.kontan.co.id/news/menanti-kehadiran-investor-baru-di-industri-perbankan",
        "timestamp": "2025-06-04T04:30:00"
    },
    {
        "id": 5238,
        "tags": [
            "Investment",
            "Financing",
            "Bullish"
        ],
        "body": "The venture capital industry in Indonesia has seen a turnaround after experiencing prolonged contraction, with financing increasing by 1.04% annually to Rp 16.49 trillion as of April 2025. This growth marks a significant improvement from the previous months, including a 0.34% contraction in March 2025 and a 0.93% decline in the month prior.",
        "source": "https://insight.kontan.co.id/news/bisnis-modal-ventura-mulai-berbalik-arah",
        "timestamp": "2025-06-04T04:25:00"
    },
    {
        "id": 5239,
        "tags": [
            "Dividends",
            "Net Profit",
            "Bullish"
        ],
        "body": "PT Unilever Indonesia Tbk (UNVR) will distribute IDR 3.35 trillion, or 99.7% of its net profit, as dividends, with IDR 1.56 trillion already paid out as interim dividends and IDR 1.79 trillion to be paid out as final dividends by July 2, 2025.",
        "source": "https://insight.kontan.co.id/news/unilever-indonesia-unvr-bagikan-dividen-final-rp-47-per-saham",
        "timestamp": "2025-06-04T04:19:00"
    },
    {
        "id": 5240,
        "tags": [
            "Acquisition",
            "Agreement",
            "Bullish"
        ],
        "body": "PT Gaia Artha Dinamic is acquiring 2.61 billion shares of PT Sumber Sinergi Makmur Tbk, a telecommunications equipment distributor, in a backdoor listing deal. The acquisition is part of a growing trend of backdoor listings in Indonesia.",
        "source": "https://insight.kontan.co.id/news/baru-seumur-jagung-melantai-di-bursa-emiten-emiten-ini-berganti-pengendali",
        "timestamp": "2025-06-04T04:16:00"
    },
    {
        "id": 5241,
        "tags": [
            "Economic Growth",
            "Government",
            "Bearish"
        ],
        "body": "The Indonesian government has launched a stimulus package to boost domestic economic growth, but economists believe its impact on household consumption and liquidity in the real sector will be limited. The IDR 24.4 trillion stimulus will contribute less than 0.2% to Indonesia's IDR 22,000 trillion GDP.",
        "source": "https://insight.kontan.co.id/news/insentif-tak-cukup-seksi-untuk-dorong-konsumsi",
        "timestamp": "2025-06-04T04:15:00"
    },
    {
        "id": 5242,
        "tags": [
            "Dividends",
            "Liquidity",
            "Bullish"
        ],
        "body": "Around 35 listed companies are expected to distribute a total of IDR 51.47 trillion in dividends, mostly from their 2024 financial year performance, which is expected to boost liquidity in the stock market.",
        "source": "https://insight.kontan.co.id/news/dividen-tunai-jumbo-mengguyur-bursa",
        "timestamp": "2025-06-04T04:11:00"
    },
    {
        "id": 5243,
        "tags": [
            "Insurance",
            "Profit",
            "Operational Efficiency",
            "Bullish"
        ],
        "body": "PT Asuransi Jasa Indonesia (Jasindo) reported a 68.34% increase in profit to IDR 67.81 billion as of April 2025, attributed to efficiency in operational lines and risk management. \n",
        "source": "https://insight.kontan.co.id/news/mitigasi-diperketat-laba-asuransi-umum-meningkat",
        "timestamp": "2025-06-04T04:10:00"
    },
    {
        "id": 5221,
        "tags": [
            "Capital Injection",
            "Capital Structure",
            "Net Profit",
            "Asset Management",
            "Government",
            "Neutral"
        ],
        "body": "Lembaga Pembiayaan Ekspor Indonesia (EXIMBKPI) is expected to maintain its robust capitalization, with a 32.9% in March 2025, following a IDR5T capital infusion from the government. However, its high stock of problem loans will continue to weigh on its net interest margin, with a modest return on assets expected over the next 12-18 months.",
        "source": "https://asianbankingandfinance.net/lending-credit/news/indonesias-eximbank-maintain-robust-capitalisation",
        "timestamp": "2025-06-04T03:50:54"
    },
    {
        "id": 5220,
        "tags": [
            "MOU",
            "Government",
            "Bank Indonesia",
            "Bullish"
        ],
        "body": "Indonesia and China have signed a Memorandum of Understanding (MoU) to establish a framework for promoting bilateral transactions in local currencies, expanding the scope of their earlier agreement. The MoU was signed by the governors of Bank Indonesia and the People's Bank of China, with the Chinese Premier and Indonesian President present at the event.",
        "source": "https://asianbankingandfinance.net/cards-payments/news/china-and-indonesia-expand-scope-bilateral-transaction-cooperation",
        "timestamp": "2025-06-04T03:50:54"
    },
    {
        "id": 5244,
        "tags": [
            "Bank Indonesia",
            "Loan",
            "Bearish"
        ],
        "body": "Jakarta's banking industry has been cautious in disbursing syndicated loans for large projects, reflecting a 11.53% year-on-year decline in syndicated loan agreements worth USD 7.73 billion as of June 2, 2025, according to Bloomberg data.",
        "source": "https://insight.kontan.co.id/news/kuncuran-kredit-sindikasi-masi-sepi",
        "timestamp": "2025-06-04T00:43:00"
    },
    {
        "id": 5245,
        "tags": [
            "Agricultural Products",
            "Allocation",
            "Bullish"
        ],
        "body": "PT United Tractors Tbk (UNTR) is shifting its focus to the agricultural sector, particularly in food estate projects, amidst a change in government allocation. The company is selling heavy equipment for these projects, with Director Iwan Hadiantoro citing a change in domestic heavy equipment market trends.",
        "source": "https://insight.kontan.co.id/news/untr-ungkap-ekspansi-bisnis-alat-berat-di-food-estate-hingga-rencana-akuisisi-tambang",
        "timestamp": "2025-06-03T22:43:00"
    },
    {
        "id": 7769,
        "created_at": "2025-09-23T04:29:27.964653+00:00",
        "title": "MB Indonesia Showcases New HDS533 Coal Crusher at Mining Indonesia Expo 2025",
        "body": "At the Mining Indonesia Expo 2025, held by PT. Pamerindo Indonesia from September 17‑20, MB Indonesia unveiled its new HDS533 coal crusher designed for 50‑80 ton excavators, emphasizing its ability to process coal in harsh conditions. The event, themed \"Sustainability Industrial Transformation,\" attracted enthusiastic visitors, boosting MB Indonesia’s brand visibility and potentially increasing sales.",
        "source": "https://www.indonesiancoalandnickel.com/mb-indonesia-hadir-di-event-mining-indonesia-expo-2025/",
        "timestamp": "2025-09-22T00:00:00",
        "sector": "financials",
        "sub_sector": [
            "banks"
        ],
        "tags": [
            "Product Launch",
            "ESG",
            "Business Expansion"
        ],
        "tickers": [
            "BKSW.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 1
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7770,
        "created_at": "2025-09-23T04:29:27.964653+00:00",
        "title": "PT Hexindo Adiperkasa Tbk Launches Three New Heavy‑Equipment Models to Boost Indonesian Construction and Mining Operations",
        "body": "PT Hexindo Adiperkasa Tbk unveiled the Hitachi ZX550LC‑7G, Hitachi ZX350LC‑7G Material Handling, and Foton EV 8×4, emphasizing higher productivity, fuel efficiency, and advanced safety features for construction, mining, forestry, and plantation sectors. The company also highlighted its 36‑year legacy, exclusive distribution rights for Hitachi and Foton, and comprehensive after‑sales support across 51 branches nationwide.",
        "source": "https://www.indonesiancoalandnickel.com/penuhi-kebutuhan-industri-alat-berat-hexindo-perkenalkan-3-produk-unggulan-zx550lc-7g-zx350lc-7g-material-handling-dan-foton-ev/",
        "timestamp": "2025-09-19T00:00:00",
        "sector": "industrials",
        "sub_sector": [
            "industrial-goods"
        ],
        "tags": [
            "Product Launch",
            "Partnerships & Agreements"
        ],
        "tickers": [
            "HEXA.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 64
    },
    {
        "id": 7771,
        "created_at": "2025-09-23T04:29:27.964653+00:00",
        "title": "Indonesia May Consider Creating State Revenue Agency if Tax Targets Missed",
        "body": "Finance Minister Purbaya Yudhi Sadewa said the government could establish a state revenue agency (BPN) if tax and customs revenue efforts fail to meet targets, while noting that current revenue strategies will continue to be tested and that any decision would depend on President Prabowo Subianto’s directive. As of August 31, tax revenue fell 3.6% to Rp1.3304 trillion (55.7% of the 2025 budget outlook) and customs excise revenue grew 6.4% to Rp194.9 trillion (62.8% of the outlook).",
        "source": "https://en.antaranews.com/news/381616/indonesia-may-consider-state-revenue-agency-if-tax-targets-missed",
        "timestamp": "2025-09-22T23:23:00",
        "sector": "financials",
        "sub_sector": [
            "financing-service"
        ],
        "tags": [
            "Financial Metrics",
            "Government Policy",
            "Ministry",
            "Politics & Regulation"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7772,
        "created_at": "2025-09-23T04:29:27.964653+00:00",
        "title": "Indonesia to Fund Wages for 20,000 Interns in National Internship Program",
        "body": "Indonesia will cover the salaries of 20,000 fresh graduates in its national internship program, allocating Rp198 billion from the state budget and relieving companies of payment responsibilities. The six‑month program, part of the 2025 economic stimulus, will run three months in 2025 and three months in 2026, with wages tied to provincial minimum wages and open to both private and state‑owned firms.",
        "source": "https://en.antaranews.com/news/381552/indonesian-govt-to-cover-wages-in-national-internship-program",
        "timestamp": "2025-09-22T20:17:00",
        "sector": "consumer-cyclicals",
        "sub_sector": [
            "consumer-services"
        ],
        "tags": [
            "Government Policy",
            "Subsidies & Incentives"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7773,
        "created_at": "2025-09-23T04:29:27.964653+00:00",
        "title": "Indonesia and Turkey Draft Roadmap to Strengthen Industrial Cooperation",
        "body": "During a bilateral meeting in Istanbul, Indonesian Minister of Industry Agus Gumiwang Kartasasmita and Turkish Minister of Industry and Technology Mehmet Fatih Kacir announced a joint roadmap to deepen industrial ties, with Turkish conglomerates such as Sanko Holding, Arcelik, and Kordsa expressing interest in investing in Indonesia’s tuna farming, downstream processing, and composite materials sectors. The agreement also includes 10 business‑to‑business deals—ranging from Pertamina Hulu Energi’s partnership with Turkish petroleum firms to PT PAL Indonesia’s shipyard collaboration on Istanbul‑class frigates—and Asia Pacific Rayon’s multi‑million‑dollar viscose fiber export contracts with Turkish partners.",
        "source": "https://en.antaranews.com/news/381420/indonesia-turkiye-draft-roadmap-to-bolster-industrial-ties",
        "timestamp": "2025-09-22T13:09:00",
        "sector": "technology",
        "sub_sector": [
            "software-it-services",
            "automobiles-components"
        ],
        "tags": [
            "Business Expansion",
            "Export",
            "Foreign Investment",
            "Partnerships & Agreements",
            "Ministry"
        ],
        "tickers": [
            "BRAM.JK",
            "KIOS.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 76
    },
    {
        "id": 7779,
        "created_at": "2025-09-23T04:29:29.58757+00:00",
        "title": "Agung Menjangan Mas Reports Q1 2025 Profit of Rp677.78 Million While Facing Potential New Majority Stake by Radiant Ruby Company Ltd",
        "body": "Agung Menjangan Mas posted a Q1 2025 net profit of Rp677.78 million, up 5.25% from the same period last year, with earnings per share rising to Rp0.56. The company also announced that Radiant Ruby Company Ltd plans to acquire 80% of its shares from Mandara Mas Semesta and Hartono Limmantoro, potentially shifting majority control.",
        "source": "https://emitennews.com/news/punya-pengendali-baru-ini-performa-amms-semester-i-2025",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Financial Metrics",
            "Mergers & Acquisitions",
            "Ownership"
        ],
        "tickers": [
            "AMMS.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 96
    },
    {
        "id": 7780,
        "created_at": "2025-09-23T04:29:29.58757+00:00",
        "title": "Astrindo Nusantara Reports Significant Decline in Revenue and Profits for June 2025",
        "body": "Astrindo Nusantara posted a net loss per share of USD 0.000155, up from USD 0.000125, with revenue falling 47.4% to USD 144.83 million and gross profit dropping 60.7% to USD 14.66 million. The company’s net loss widened to USD 203.6 million, while total assets and equity both decreased compared to the previous year.",
        "source": "https://emitennews.com/news/berbalik-boncos-paruh-pertama-2025-bipi-defisit-usd2036-juta",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "energy",
        "sub_sector": [
            "oil-gas-coal"
        ],
        "tags": [
            "Financial Metrics"
        ],
        "tickers": [
            "BIPI.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7774,
        "created_at": "2025-09-23T04:29:28.766726+00:00",
        "title": "PT Merdeka Gold Resources TBK. Debuts on IDX, Raising Rp4.66 Trillion in IPO to Fund Pani Gold Project",
        "body": "PT Merdeka Gold Resources TBK. completed its IPO on the Indonesia Stock Exchange, raising Rp4.66 trillion by selling 1.62 billion shares at Rp2.880 per share, with the stock opening 25 % higher. The proceeds will fund capital contributions to PT Pani Bersama Tambang, a loan to PT Puncak Emas Tani Sejahtera, and early debt repayment, while the company continues to develop its Pani Gold project in Gorontalo, targeting first production in Q1 2026 and a peak output of 500 k troy ounces per year by 2033, with post‑IPO ownership of MDKA 56.5 %, treasury 9 %, and public 34.5 %.",
        "source": "https://emitennews.com/news/merdeka-gold-emas-resmi-listing-sahamnya-melejit-ara",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Capital & Funding",
            "Production & Operations",
            "Business Expansion",
            "Bullish"
        ],
        "tickers": [
            "MDKA.JK"
        ],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 2,
            "technical": 2,
            "valuation": 2,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 101
    },
    {
        "id": 7775,
        "created_at": "2025-09-23T04:29:28.766726+00:00",
        "title": "Omni Inovasi Indonesia Reports First-Half 2025 Losses, Revenue Down 80% YoY",
        "body": "The company posted a net loss of Rp18.87 billion for the first half of 2025, with revenue falling 80.13% to Rp295.04 billion compared to Rp1.46 trillion a year earlier. Operating profit slid 84.23% to Rp1.16 billion, while total assets declined to Rp93.75 billion from Rp97.53 billion.",
        "source": "https://emitennews.com/news/makin-bengkak-juni-2025-tele-defisit-rp65-triliun",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "consumer-cyclicals",
        "sub_sector": [
            "retailing"
        ],
        "tags": [
            "Financial Metrics"
        ],
        "tickers": [
            "TELE.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7776,
        "created_at": "2025-09-23T04:29:28.766726+00:00",
        "title": "Bank Victoria to Issue Rp750 Billion Sustainable Bond in 2025",
        "body": "Bank Victoria will issue a Rp750 billion sustainable bond (Stage II of Sustainable Bond IV) with an 8.25% coupon, 3‑year maturity, and quarterly interest payments starting 26 Dec 2025, with final payment and principal repayment on 26 Sep 2028. Proceeds, after issuance costs, will be used for working capital and credit expansion, with the public offering scheduled from 22–24 Sep 2025 and settlement on 26 Sep 2025.",
        "source": "https://emitennews.com/news/banderol-bunga-825-persen-bvic-mulai-jajakan-obligasi-rp750-miliar",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "financials",
        "sub_sector": [
            "banks"
        ],
        "tags": [
            "Bonds",
            "Debt Issuance",
            "Capital & Funding"
        ],
        "tickers": [
            "BVIC.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 1
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7777,
        "created_at": "2025-09-23T04:29:28.766726+00:00",
        "title": "Madhani Talatah Nusantara sells 2.04 billion Darma Henwa shares, raising Rp153.13 billion",
        "body": "On 17 September 2025, Madhani Talatah Nusantara divested 2.041832 billion Darma Henwa shares at Rp75 per share, a price 66.51 % below the Bakrie Group closing price, and collected Rp153.13 billion. The sale cut its holdings to 3.28 billion shares (8.07 % of the total), diluting its stake by 5.02 % from the pre‑transaction level of 5.32 billion shares, while pre‑transaction donation shares were 13.09 %.",
        "source": "https://emitennews.com/news/lego-204-miliar-saham-dewa-madhani-raup-rp15313-miliar",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "energy",
        "sub_sector": [
            "oil-gas-coal"
        ],
        "tags": [
            "Ownership",
            "Financial Metrics"
        ],
        "tickers": [
            "DEWA.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7778,
        "created_at": "2025-09-23T04:29:28.766726+00:00",
        "title": "Intiputra and JSI Sinergi Mas Complete Share Divestments in Leyand International, Reducing Stakes to 13.47% and 8.78%",
        "body": "Intiputra sold 236.23 million shares of Leyand International at Rp155 each, raising Rp36.61 billion and leaving it with 13.47% of the company. JSI Sinergi Mas purchased 209.23 million shares at the same price, paying Rp32.43 billion and increasing its holding to 8.78%.",
        "source": "https://emitennews.com/news/banting-harga-pengendali-obral-jutaan-saham-lapd-rp3661-miliar",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "infrastructures",
        "sub_sector": [
            "utilities"
        ],
        "tags": [
            "Ownership"
        ],
        "tickers": [
            "LAPD.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7781,
        "created_at": "2025-09-23T04:29:29.58757+00:00",
        "title": "Ancoa Indonesia Resources converts USD 19.33 million debt into equity by transferring 100% of Indotan Lombok Pte Ltd shares, extending principal repayment to 31 Dec 2045 and reducing interest to 3% per annum.",
        "body": "Ancoa Indonesia Resources has restructured its USD 19.33 million debt owed to Oliva Vera Dome Holding Ltd by converting the principal into a tranche due 31 Dec 2045 and exchanging USD 6.5 million of the interest tranche for 100% of its Indotan Lombok Pte Ltd shares, while the remaining interest will be paid annually from 2036 at a reduced 3% rate. The company plans to focus on its mining explosives business and pursue new opportunities to become an integrated energy solutions provider.",
        "source": "https://emitennews.com/news/simak-okas-ungkap-alasan-konversi-utang-dengan-aset",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Capital & Funding",
            "Business Expansion"
        ],
        "tickers": [
            "OKAS.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7782,
        "created_at": "2025-09-23T04:29:29.58757+00:00",
        "title": "Dian Swastatika Sentosa Reports Large Jumbo Share Transaction and Announces New Corporate Actions",
        "body": "On September 19, 2025, Dian Swastatika Sentosa disclosed a mysterious 299‑million‑share jumbo transaction worth Rp32.4 trillion involving Sinarmas Sekuritas and CGS International Sekuritas Indonesia, which the company says is unrelated to its main shareholders or treasury share sales. The company also announced a 5‑year fixed‑rate bond issuance at 6.875 % and a 3‑ and 5‑year sukuk mudharabah series totaling Rp1.5 trillion, and a strategic partnership with PT Firstgen Geothermal Indonesia.",
        "source": "https://emitennews.com/news/grup-sinarmas-dssa-beber-transaksi-jumbo-rp324-triliun",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "energy",
        "sub_sector": [
            "oil-gas-coal"
        ],
        "tags": [
            "Bonds",
            "Capital & Funding",
            "Sharia Economy",
            "Partnerships & Agreements"
        ],
        "tickers": [
            "DSSA.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 71
    },
    {
        "id": 7783,
        "created_at": "2025-09-23T04:29:29.58757+00:00",
        "title": "Astra International Accumulates 2.98 Million Shares of Medikaloka Hermina, Raising Total Stake to 20.02%",
        "body": "Astra International, via Astra Healthcare Indonesia and CLSA Sekuritas Indonesia, bought 2,978,500 shares of Medikaloka Hermina (RS Hermina) in four transactions from September 9‑12 2025, spending roughly Rp4.98 billion and boosting its indirect holding to 12.79% and overall ownership to 20.02%. The purchases were made at prices ranging from Rp1,683.14 to Rp1,850 per share, totaling about Rp2.69 trillion.",
        "source": "https://emitennews.com/news/nyicil-astra-group-asii-kembali-gulung-jutaan-saham-heal",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "healthcare",
        "sub_sector": [
            "healthcare-equipment-providers",
            "multi-sector-holdings"
        ],
        "tags": [
            "Ownership"
        ],
        "tickers": [
            "ASII.JK",
            "HEAL.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7784,
        "created_at": "2025-09-23T04:29:30.426732+00:00",
        "title": "Matra Tri Abadi becomes majority shareholder of IRXS after buying 760 million shares, while PT Buana Megah Wicaksana divests its entire stake",
        "body": "Matra Tri Abadi bought 760 million shares of IRXS at Rp25 each, increasing its ownership from 2.64 billion to 3.4 billion shares and becoming the majority shareholder. PT Buana Megah Wicaksana sold its entire 760 million-share holding (12.27 %) for the same price, ending its stake in the company.",
        "source": "https://emitennews.com/news/matra-tri-abadi-kini-kuasai-5488-saham-aviana-sinar-abadi-irsx",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "technology",
        "sub_sector": [
            "software-it-services"
        ],
        "tags": [
            "Ownership"
        ],
        "tickers": [
            "IRSX.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7785,
        "created_at": "2025-09-23T04:29:30.426732+00:00",
        "title": "pt bank syariah indonesia tbk's gold and bullion services see strong growth in Q2 2025",
        "body": "In Q2 2025, bsi recorded Rp9.1 trillion in outstanding gold installment loans, up 155% YoY, served by 162.8k customers. Its gold pawn and bsi gold products also grew, with 407k pawn customers and 152k bsi gold users, and outstanding amounts rising 44% and 110% respectively.",
        "source": "https://emitennews.com/news/masih-jadi-andalan-layanan-cicil-emas-bsi-bris-capai-rp9-triliun",
        "timestamp": "2025-09-22T00:00:00",
        "sector": "financials",
        "sub_sector": [
            "banks"
        ],
        "tags": [
            "Financial Metrics",
            "Credit",
            "Commodities"
        ],
        "tickers": [
            "BRIS.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7786,
        "created_at": "2025-09-23T04:29:30.426732+00:00",
        "title": "OJK Signals Extension of Buyback Relaxation Policy Without Shareholder Approval Until September 2025",
        "body": "The Financial Services Authority (OJK) confirmed it will extend the buyback relaxation policy, allowing issuers to repurchase shares without shareholder approval until 19 September 2025, as a measure to stabilize prices amid market volatility. The policy, originally in effect from 19 March to 19 September 2025, will be reviewed every six months, with the market viewing the extension as a strong signal of the exchange’s commitment to stability.",
        "source": "https://emitennews.com/news/ojk-beri-sinyal-perpanjang-buyback-saham-tanpa-rups",
        "timestamp": "2025-09-22T00:00:00",
        "sector": "financials",
        "sub_sector": [
            "investment-service"
        ],
        "tags": [
            "Stock Buyback",
            "OJK",
            "Politics & Regulation"
        ],
        "tickers": [],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7787,
        "created_at": "2025-09-23T04:29:30.426732+00:00",
        "title": "Barito Renewables Increases Free Float Through Green Era Pte Ltd Stock Sale on September 15, 2025",
        "body": "On September 15, 2025, Green Era Pte Ltd sold 39,600,000 shares of Barito Renewables at an average price of Rp 8,300, adding 0.02960% to the company's free float and boosting liquidity, following a prior three‑stage sale in early September that totaled 78.67 million shares. The move, confirmed by director Merly, is expected to improve market liquidity and support the strengthening of the Indonesian Stock Exchange index.",
        "source": "https://emitennews.com/news/free-float-barito-renewables-bren-kembali-bertambah",
        "timestamp": "2025-09-22T00:00:00",
        "sector": "infrastructures",
        "sub_sector": [
            "utilities"
        ],
        "tags": [
            "Capital & Funding",
            "Ownership",
            "Market Sentiment"
        ],
        "tickers": [
            "BREN.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7788,
        "created_at": "2025-09-23T04:29:30.426732+00:00",
        "title": "Radiant Ruby Company Ltd Plans to Acquire 80% of AMMS Shares, Potentially Becoming New Controlling Stakeholder",
        "body": "Radiant Ruby Company Ltd has sent a formal notice on 22 September 2025 announcing negotiations to acquire about 80% of AMMS shares currently held by PT Mandara Mas Semesta and Hartono Limmantoro, which would shift control of AMMS to Radiant. AMMS shares rose 10% to Rp242 on Monday, marking a 59.2% increase over the past month and a 462% rise in six months from Rp43 on 24 March 2025.",
        "source": "https://emitennews.com/news/amms-umumkan-bakal-ada-pengendali-baru",
        "timestamp": "2025-09-22T00:00:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Mergers & Acquisitions",
            "Ownership",
            "Bullish"
        ],
        "tickers": [
            "AMMS.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 2,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 96
    },
    {
        "id": 7789,
        "created_at": "2025-09-23T04:29:31.263947+00:00",
        "title": "PT Ancara Logistics Indonesia Tbk Reports 14.5% Net Profit Growth to Rp208.16 Billion in First Half 2025",
        "body": "The company posted a net profit attributable to the parent of Rp208.16 billion, up 14.5% from Rp181.72 billion in the same period last year, while revenue rose 5.3% to Rp544.88 billion. Total liabilities fell 15.5% to Rp642.35 billion and total assets edged up 1.9% to Rp2.62 trillion, with the stock gaining 2.83% to Rp545 per share.",
        "source": "https://emitennews.com/news/angkutan-tambang-grup-bakrie-alii-raih-laba-naik-145-di-medio-2025",
        "timestamp": "2025-09-22T00:00:00",
        "sector": "energy",
        "sub_sector": [
            "oil-gas-coal"
        ],
        "tags": [
            "Financial Metrics",
            "Market Sentiment",
            "Bullish"
        ],
        "tickers": [
            "ALII.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7790,
        "created_at": "2025-09-23T04:29:31.263947+00:00",
        "title": "PT Bank Syariah Indonesia Tbk Reports 10.3% Net Profit Growth to Rp3.74 Trillion in H1 2025",
        "body": "The bank posted a net profit of Rp3.74 trillion for the first half of 2025, up 10.3% from Rp3.39 trillion a year earlier, while its share of profit increased 15.4% to Rp9.52 trillion and other income grew 17.1% to Rp2.94 trillion. Despite a 20% rise in operating expenses to Rp6.16 trillion, operating profit rose 10% to Rp4.95 trillion, and the bank’s liabilities fell 5.9% to Rp99.45 trillion as total assets declined 2% to Rp400.56 trillion.",
        "source": "https://emitennews.com/news/bsi-bris-cetak-laba-rp374t-tumbuh-103-di-semester-i",
        "timestamp": "2025-09-22T00:00:00",
        "sector": "financials",
        "sub_sector": [
            "banks"
        ],
        "tags": [
            "Financial Metrics"
        ],
        "tickers": [
            "BRIS.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7791,
        "created_at": "2025-09-24T04:32:14.674618+00:00",
        "title": "PT United Tractors Tbk Wins Four Awards at Tempo–IDNFinancials 52 2025 Investor Appreciation Night",
        "body": "PT United Tractors Tbk (UNTR) received awards in the Main Index, High Dividend, High Growth, and Big Market Capitalization categories during the Tempo–IDNFinancials 52 2025 Investor Appreciation Night in Jakarta, highlighting its consistent financial performance and solid business growth. The recognition underscores the company’s commitment to ESG principles and its resilience amid global economic challenges.",
        "source": "https://www.indonesiancoalandnickel.com/kinerja-bisnis-solid-united-tractors-raih-4-penghargaan-indeks-tempo-idnfinancials-52-2025/",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "industrials",
        "sub_sector": [
            "industrial-goods"
        ],
        "tags": [
            "Award",
            "ESG",
            "Global Economy"
        ],
        "tickers": [
            "UNTR.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 1
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7792,
        "created_at": "2025-09-24T04:32:14.674618+00:00",
        "title": "Indonesia Sets Regulations to Price Electricity from Waste‑to‑Energy Plants, Aiming for 30 New Facilities in 18 Months",
        "body": "Indonesia’s Energy Mineral Resources Ministry will regulate pricing for electricity generated from incineration, gasification, bioenergy, and pyrolysis processes, as announced by Deputy Minister Yuliot Tanjung at the Green Energy Summit. The government plans to build 30 waste‑to‑energy plants in major cities, each with a 20 MW capacity, within an 18‑month accelerated timeline set by President Prabowo Subianto, while 40.1 % of the 33.8 million tons of waste accumulated in 2024 remains unmanaged.",
        "source": "https://en.antaranews.com/news/381900/indonesia-govt-to-regulate-price-of-waste-to-electricity",
        "timestamp": "2025-09-23T22:11:00",
        "sector": "energy",
        "sub_sector": [
            "alternative-energy"
        ],
        "tags": [
            "Ministry",
            "Government Policy",
            "Business Expansion",
            "ESG"
        ],
        "tickers": [],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 2
        },
        "votes": null,
        "score": 71
    },
    {
        "id": 7793,
        "created_at": "2025-09-24T04:32:14.674618+00:00",
        "title": "Indonesia's Red White Cooperatives Aim to Create 1 Million Jobs by End-2025",
        "body": "Cooperatives Minister Ferry Juliantono announced that Indonesia’s 80 million red‑white cooperative units could generate up to 1 million jobs by the end of 2025, with 80,000 units already operational and 16,000‑20,000 units targeted for state‑bank funding of up to Rp3 billion each. The ministry is deploying 1,104 project managers, 8,000 business assistants, and training programs to support the units and is seeking low‑interest loans and tax incentives from the state‑owned banks association, himbara.",
        "source": "https://en.antaranews.com/news/381859/red-and-white-cooperatives-to-open-up-to-1-mln-new-jobs-by-2025-end",
        "timestamp": "2025-09-23T19:17:00",
        "sector": "financials",
        "sub_sector": [
            "financing-service"
        ],
        "tags": [
            "Capital & Funding",
            "Government Policy",
            "Subsidies & Incentives",
            "Business Expansion"
        ],
        "tickers": [],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 76
    },
    {
        "id": 7794,
        "created_at": "2025-09-24T04:32:14.674618+00:00",
        "title": "Indonesia and EU Sign Comprehensive Economic Partnership Agreement to Boost EV Investment and SME Access to European Markets",
        "body": "At a press conference in Nusa Dua, Bali, Indonesia’s Coordinating Minister for Economic Affairs Airlangga Hartarto announced the signing of the Indonesia‑EU Comprehensive Economic Partnership Agreement, which will open major investment opportunities in electric vehicles, minerals, and renewable energy, and provide zero tariffs on 90% of EU imports. The deal is projected to raise Indonesia’s national income by USD 2.8 billion, increase exports to the EU by 60%, create jobs for five million workers, and simplify trade procedures for SMEs.",
        "source": "https://en.antaranews.com/news/381855/ieu-cepa-to-boost-ev-investment-create-jobs-in-indonesia-minister",
        "timestamp": "2025-09-23T18:54:00",
        "sector": "consumer-cyclicals",
        "sub_sector": [
            "automobiles-components"
        ],
        "tags": [
            "Export",
            "Tariff & VAT",
            "Business Expansion",
            "Global Economy",
            "Foreign Investment"
        ],
        "tickers": [],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 1
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7795,
        "created_at": "2025-09-24T04:32:14.674618+00:00",
        "title": "Indonesia Prepares Measures to Comply with Upcoming EU Deforestation Regulation",
        "body": "Indonesia’s Trade Ministry is coordinating with stakeholders to assess the impact of the EU deforestation regulation on key export commodities such as palm oil, rubber, coffee, cocoa, and wood, and is implementing traceability, certification, and data‑dashboard initiatives to meet EU compliance. The government also supports MSMEs and is engaging in bilateral dialogues and WTO forums to address potential trade disruptions.",
        "source": "https://en.antaranews.com/news/381843/indonesia-readies-strategy-for-eu-deforestation-regulation",
        "timestamp": "2025-09-23T18:18:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Commodities",
            "Export",
            "Government Policy"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 2
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7796,
        "created_at": "2025-09-24T04:32:15.536931+00:00",
        "title": "Indonesia’s Industry Minister Signals Support for Turkey’s Aspilsan in Joint EV Battery Development",
        "body": "During a visit to the Teknofest aerospace technology festival in Istanbul, Indonesia’s Minister of Industry Agus Gumiwang Kartasasmita announced Indonesia’s readiness to collaborate with Turkey’s battery company Aspilsan through joint research, investment, and technology transfer to strengthen regional EV battery supply chains. The partnership comes as Indonesia’s EV market grows from 116,000 units in 2023 to 207,000 in 2024, and the country’s newly launched EV battery ecosystem megaproject, valued at USD 5.9 billion, seeks to boost local production capacity, with Aspilsan’s annual output of 21.6 million units.",
        "source": "https://en.antaranews.com/news/381834/indonesia-trkiye-joint-push-to-boost-ev-battery-industry",
        "timestamp": "2025-09-23T17:21:00",
        "sector": "consumer-cyclicals",
        "sub_sector": [
            "automobiles-components"
        ],
        "tags": [
            "Foreign Investment",
            "Partnerships & Agreements",
            "Business Expansion",
            "Capital & Funding",
            "Joint Operation"
        ],
        "tickers": [],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7797,
        "created_at": "2025-09-24T04:32:15.536931+00:00",
        "title": "Indonesia Nears Completion of 1.5 Trillion IDR Sugar Absorption Program, Leaving 16,000 Tons Unpurchased",
        "body": "Indonesia’s Ministry of Agriculture reports that the 1.5 trillion IDR absorption program, funded through PT Danantara and executed by PT Rajawali Nusantara Indonesia and PT Sinergi Gula Nusantara, has bought 40,000 tons of sugar and now only 16,000 tons remain unpurchased, with the scheme designed to stabilize domestic prices and protect farmers’ welfare.",
        "source": "https://en.antaranews.com/news/381816/absorption-of-farmers-sugar-reaches-nearly-100-percent-minister",
        "timestamp": "2025-09-23T16:56:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Government Policy",
            "Subsidies & Incentives"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 1
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7798,
        "created_at": "2025-09-24T04:32:15.536931+00:00",
        "title": "Indonesian government suspends 190 mineral and coal mine permits",
        "body": "The Indonesian government has suspended permits for 190 mineral and coal mining companies after a comprehensive evaluation by the Directorate General of Mineral and Coal, citing violations of post‑mining reclamation policies and compliance issues. The suspension will remain in effect until the Directorate General’s assessment is completed, and companies may have their permits reinstated depending on the evaluation outcome.",
        "source": "https://en.antaranews.com/news/381813/indonesian-govt-suspends-190-mineral-coal-mine-permits",
        "timestamp": "2025-09-23T16:52:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Government Policy",
            "Commodities",
            "Risk & Compliance",
            "Politics & Regulation"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 1
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7799,
        "created_at": "2025-09-24T04:32:15.536931+00:00",
        "title": "Indonesia and EU Finalize Comprehensive Economic Partnership Agreement After Nine Years of Negotiations",
        "body": "Indonesia and the European Union have finalized the Comprehensive Economic Partnership Agreement after nine years of negotiations, marking a historic milestone that will expand market access, investment, and competitiveness. The agreement comes as trade between the two sides reached $30.1 billion in 2024, with Indonesia running a $4.5 billion surplus.",
        "source": "https://en.antaranews.com/news/381676/ieu-cepa-opens-up-fair-trade-cooperation-opportunities-ministry",
        "timestamp": "2025-09-23T11:47:00",
        "sector": "financials",
        "sub_sector": [
            "investment-service"
        ],
        "tags": [
            "Global Economy",
            "Export",
            "Import",
            "Business Expansion",
            "Foreign Investment"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7800,
        "created_at": "2025-09-24T04:32:15.536931+00:00",
        "title": "Indonesia Stock Exchange Suspends Trading of Several Companies Amid Rapid Price Surges",
        "body": "The Bursa Efek Indonesia temporarily halted trading of PT Indonesian Tobacco Tbk., PT Multisarana Intan Eduka Tbk., PT Geoprima Solusi Tbk., and PT Dana Brata Luhur Tbk. to cool down unusually high cumulative price spikes, while shares of itic, msie, and gpso saw weekly gains of 49.69%, 31.65%, and 93.59% respectively and will resume trading the next day; tebe faces a longer second suspension.",
        "source": "https://emitennews.com/news/4-saham-meroket-disetop-satu-dari-fca-melejit-700-persen",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "properties-real-estate",
        "sub_sector": [
            "properties-real-estate",
            "industrial-goods",
            "tobacco",
            "oil-gas-coal"
        ],
        "tags": [
            "Trading Halt",
            "Suspension",
            "Bullish"
        ],
        "tickers": [
            "MSIE.JK",
            "GPSO.JK",
            "TEBE.JK",
            "ITIC.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 2,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7801,
        "created_at": "2025-09-24T04:32:16.404726+00:00",
        "title": "PT Astra Agro Lestari Tbk Announces Interim Dividend for FY 2025, With Payment Scheduled for October 24, 2025",
        "body": "PT Astra Agro Lestari Tbk will distribute an interim dividend of Rp123 per share, totaling Rp236.736.664.959, based on net profit of Rp702.121.446.485 as of June 30, 2025. The dividend schedule includes cum/ex dates from October 2 to 7, 2025, with payment on October 24, 2025.",
        "source": "https://emitennews.com/news/astra-agro-aali-bagikan-dividen-interim-rp2367m-cek-jadwalnya",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Dividend Announcement",
            "Financial Metrics"
        ],
        "tickers": [
            "AALI.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 91
    },
    {
        "id": 7802,
        "created_at": "2025-09-24T04:32:16.404726+00:00",
        "title": "Erwin Ciputra increases Petrosea stake to 10.05 million shares, raising ownership to 0.0997% after buying 1 million shares at Rp5,425 each",
        "body": "On September 22, 2025, Erwin Ciputra purchased 1 million Petrosea shares at Rp5,425 per share, spending Rp5.42 billion and boosting his holdings from 9.05 million shares (0.0898%) to 10.05 million shares (0.0997%). The transaction, classified as a direct investment, raised his ownership by roughly 0.0099 percentage points.",
        "source": "https://emitennews.com/news/pentolan-ini-timbun-jutaan-saham-ptro-rp5425-per-lembar",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "energy",
        "sub_sector": [
            "oil-gas-coal"
        ],
        "tags": [
            "Ownership",
            "Financial Metrics"
        ],
        "tickers": [
            "PTRO.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 1,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7803,
        "created_at": "2025-09-24T04:32:16.404726+00:00",
        "title": "Emitennews.com to Offer Rp500 Billion Bond Issuance with Dual Series and Best‑Effort Commitment",
        "body": "Emitennews.com will issue Rp500 billion in bonds, split into a Rp245.12 billion series with 10% annual fixed interest over 370 days and a Rp6.96 billion Series B with 10.75% annual interest over two years, while the remaining Rp247.91 billion will be offered on a best‑effort basis. The bonds will pay quarterly coupons starting January 15 2026, with final payments on October 25 2026 for the first series and October 15 2027 for Series B, and proceeds after issuance costs will be used for working capital.",
        "source": "https://emitennews.com/news/tambah-modal-sger-tawarkan-obligasi-rp500-miliar",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "energy",
        "sub_sector": [
            "oil-gas-coal"
        ],
        "tags": [
            "Debt Issuance",
            "Bonds",
            "Capital & Funding",
            "Interest Rate"
        ],
        "tickers": [
            "SGER.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7804,
        "created_at": "2025-09-24T04:32:16.404726+00:00",
        "title": "Sulistiono Acquires 5.2% Stake in Asri Karya Lestari, While Berjaya Capital Divests 10.4% Shareholding",
        "body": "Sulistiono purchased 325 million shares of Asri Karya Lestari at Rp45 per share, paying Rp14.62 billion and securing a 5.2% stake. Berjaya Capital Investama sold its entire 650 million‑share holding (10.4%) at the same price, raising Rp29.25 billion and exiting the company.",
        "source": "https://emitennews.com/news/nabung-bos-asli-gulung-325-juta-saham-rp1462-miliar",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "infrastructures",
        "sub_sector": [
            "heavy-constructions-civil-engineering"
        ],
        "tags": [
            "Ownership"
        ],
        "tickers": [
            "ASLI.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7805,
        "created_at": "2025-09-24T04:32:16.404726+00:00",
        "title": "Trimegah Sekuritas to Offer Rp500 Billion Bond Issuance as Part of Rp2 Trillion Sustainable Bond Program",
        "body": "Trimegah Sekuritas will issue Rp500 billion in bonds, comprising Rp90 billion fully guaranteed and Rp410 billion best‑effort guaranteed, with coupon rates of 6.75% for 370‑day terms and 8.25% for 3‑year terms, and proceeds will be used for working capital. The public offering runs from 3–6 October 2025, with first coupon payments on 8 January 2026 and final maturities on 18 October 2026 (Series A) and 8 October 2028 (Series B).",
        "source": "https://emitennews.com/news/broker-boy-thohir-trim-jajakan-obligasi-rp500-m-simak-tujuannya",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "financials",
        "sub_sector": [
            "investment-service"
        ],
        "tags": [
            "Debt Issuance",
            "Bonds",
            "Capital & Funding",
            "Interest Rate"
        ],
        "tickers": [
            "TRIM.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 1,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7806,
        "created_at": "2025-09-24T04:32:17.272867+00:00",
        "title": "Maju Selaras Jaya Acquires 338.05 Million Shares of Multi Spunindo at Rp332 per Share, Raising Ownership to 63.84%",
        "body": "On September 22, 2025, Maju Selaras Jaya purchased 338,054,244 shares of Multi Spunindo at an execution price of Rp332 per share—about 9.93% above the closing price of Rp302—paying Rp112.23 billion and increasing its stake to 63.84% from 58.1%. The transaction, described as an investment, boosted the company’s shareholding by 5.75 percentage points.",
        "source": "https://emitennews.com/news/premium-maju-selaras-angkut-33805-juta-saham-msja-rp11223-miliar",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "nondurable-household-products"
        ],
        "tags": [
            "Ownership",
            "Mergers & Acquisitions"
        ],
        "tickers": [
            "MSJA.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7807,
        "created_at": "2025-09-24T04:32:17.272867+00:00",
        "title": "Astra International Invests Rp8.6 Trillion to Expand Health Ecosystem, Boosting Stakes in Halodoc and Medikaloka Hermina",
        "body": "Astra International has poured Rp8.6 trillion into its health sector portfolio, raising its shareholding in Halodoc to 31% and Medikaloka Hermina to 20.02% (12.79% indirect), while acquiring 2.97 million shares of RS Hermina for Rp4.98 billion and completing a four‑transaction purchase totaling Rp2.69 trillion at prices between Rp1,683.14 and Rp1,850 per share, a move that lifted its indirect stake by 9.58%.",
        "source": "https://emitennews.com/news/astra-asii-beber-investasi-jumbo-sektor-healthcare",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "healthcare",
        "sub_sector": [
            "healthcare-equipment-providers",
            "multi-sector-holdings"
        ],
        "tags": [
            "Business Expansion",
            "Ownership",
            "Domestic Investor"
        ],
        "tickers": [
            "ASII.JK",
            "HEAL.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7808,
        "created_at": "2025-09-24T04:32:17.272867+00:00",
        "title": "Bank Rakyat Indonesia Enhances Brimo App with Credit Card as Primary Qris Payment Source",
        "body": "Bank Rakyat Indonesia’s Brimo app now lets users use their BRI credit card as the main source of funds for Qris payments, offering flexibility and convenience for both merchant‑presented and online transactions. Approved credit card applicants can also receive up to Rp150,000 vouchers and exclusive merchant discounts, while the app provides instant access to card details and billing information.",
        "source": "https://emitennews.com/news/makin-mudah-bayar-qris-dengan-kartu-kredit-bri-di-super-apps-brimo",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "financials",
        "sub_sector": [
            "banks"
        ],
        "tags": [
            "Digital Payments",
            "Credit"
        ],
        "tickers": [
            "BBRI.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7809,
        "created_at": "2025-09-24T04:32:17.272867+00:00",
        "title": "Hartono Limmantoro Increases AMMS Holdings Amid Potential Radiant Ruby Takeover",
        "body": "Director Hartono Limmantoro of AMMS increased his stake by purchasing 9,832,600 shares for Rp1.96 billion, raising his ownership to 2.47 % from 1.71 %. Meanwhile, Radiant Ruby Company Ltd has expressed intent to acquire roughly 80 % of AMMS shares held by PT Mandara Mas Semesta and Hartono, potentially shifting control, while AMMS shares surged 9.92 % to Rp266 on the day of the announcement.",
        "source": "https://emitennews.com/news/dirut-borong-98-juta-lembar-saham-amms-ngegas-ara",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Ownership",
            "Mergers & Acquisitions",
            "Market Sentiment",
            "Bullish"
        ],
        "tickers": [
            "AMMS.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 2,
            "valuation": 2,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 106
    },
    {
        "id": 7810,
        "created_at": "2025-09-24T04:32:17.272867+00:00",
        "title": "PT Asuransi Tugu Pratama Indonesia Tbk Shares Surge 6.2% to Highest in Three Months, Analysts Cite Undervalued Valuation and Strong Fundamentals",
        "body": "The stock closed at Rp1,030, up 6.2%, with trading volume 16.3 million shares—over nine times the weekly average—while the market cap sits at Rp3.66 trillion and a PBV of 0.37x, prompting analysts to project a target price of Rp1,962 and potential upside of about 90% based on a theoretical fair value near Rp1,700. Strong fundamentals include Rp32.6 trillion in assets, a 40% dividend payout, and a solvency ratio above 120%, positioning the company as a leading general‑insurance player with attractive value and dividend play characteristics.",
        "source": "https://emitennews.com/news/saham-tugu-melambung-valuasinya-dinilai-masih-murah",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "financials",
        "sub_sector": [
            "insurance"
        ],
        "tags": [
            "Dividend Announcement",
            "Financial Metrics",
            "Analyst Ratings",
            "Undervalued",
            "Bullish"
        ],
        "tickers": [
            "TUGU.JK"
        ],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 2,
            "valuation": 2,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7811,
        "created_at": "2025-09-24T04:32:18.097969+00:00",
        "title": "Candra Gunawan Begins Investment in PT Maxindo Karya Anugerah Tbk by Buying 82.56 Million Shares at Rp53 Each",
        "body": "Candra Gunawan, a commissioner of PT Maxindo Karya Anugerah Tbk, started his first investment in the company by purchasing 82.56 million shares at Rp53 per share, valuing the transaction at approximately Rp4.38 billion. After the purchase, his holdings increased to 82.56 million shares, representing 0.86% of the company, while the stock price remained steady at Rp60 during Tuesday's midday trading.",
        "source": "https://emitennews.com/news/aksi-perdana-komisaris-maxi-serok-puluhan-juta-saham-harga-diskon",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Ownership",
            "Domestic Investor",
            "Neutral"
        ],
        "tickers": [
            "MAXI.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 91
    },
    {
        "id": 7812,
        "created_at": "2025-09-24T04:32:18.097969+00:00",
        "title": "PT Impack Pratama Industri Tbk Reports 1.67 Billion Share Transfer by PT Tunggal Jaya Investama, Reducing Ownership to 39.11%",
        "body": "PT Tunggal Jaya Investama transferred 1.67 billion shares of PT Impack Pratama Industri Tbk through a repurchase agreement at Rp650 per share, lowering its stake from 42.15% to 39.11% while the shares fell 0.77% to Rp1,940 on Tuesday. Over the past month the stock has risen 114.3%, and it has surged 548% over six months and 444.6% year‑to‑date from its March 24 and January 2 prices, respectively.",
        "source": "https://emitennews.com/news/pemilik-impack-pratama-impc-repo-167-miliar-saham-harga-obral",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "industrials",
        "sub_sector": [
            "industrial-goods"
        ],
        "tags": [
            "Stock Buyback",
            "Ownership",
            "Bearish"
        ],
        "tickers": [
            "IMPC.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 91
    },
    {
        "id": 7813,
        "created_at": "2025-09-24T04:32:18.097969+00:00",
        "title": "cakra bhakti para putra increases controlling stake in pt steel pipe industry indonesia tbk by buying 2.88 million issp shares",
        "body": "cakra bhakti para putra, the controlling entity of pt steel pipe industry indonesia tbk (spindo), purchased 2.88 million issp shares at rp410 each, raising its stake to 57.29% of the fully paid capital from 57.25%. The transaction, valued at about rp1.18 billion, coincided with a 10.45% rise in issp shares to rp444 on Tuesday.",
        "source": "https://emitennews.com/news/pengendali-issp-borong-saham-harga-bawah-ini-alasannya",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Ownership",
            "Domestic Investor",
            "Bullish"
        ],
        "tickers": [
            "ISSP.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 2,
            "valuation": 2,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7814,
        "created_at": "2025-09-24T04:32:18.097969+00:00",
        "title": "UBS Group AG's Rapid Buy‑Sell Activity Alters Its Shareholding in PT Bumi Resources Tbk",
        "body": "On September 16 and 17, 2025, UBS Group AG sold 306.76 million Bumi shares at an average price of Rp117.06, reducing its stake from 26.28 billion to 25.97 billion shares, then repurchased 89.97 million shares at Rp113.43 on September 17, bringing its holding back to 26.06 billion shares (7.02 %). The transactions, totaling roughly Rp46.1 billion, were described by Bumi’s corporate secretary Irana Candra Mala as client‑derivative hedging, while Bumi’s stock surged 13.22 % to Rp137 on the day of the sale.",
        "source": "https://emitennews.com/news/saham-bumi-terbang-ubs-group-transaksi-jual-beli-rp461m",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "energy",
        "sub_sector": [
            "oil-gas-coal"
        ],
        "tags": [
            "Asset Management",
            "Foreign Investment",
            "Market Sentiment",
            "Bullish"
        ],
        "tickers": [
            "BUMI.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 2,
            "valuation": 2,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 91
    },
    {
        "id": 7815,
        "created_at": "2025-09-24T04:32:18.097969+00:00",
        "title": "PT Suparma Tbk to Hold Extraordinary General Meeting on Oct 30, 2025, to Approve a 100:30 Stock Dividend Plan",
        "body": "The meeting will approve a stock dividend of up to 946.23 million new shares, with a nominal value of Rp400 per share, and the dividend ratio may be adjusted based on SPMA’s market price before the close of trading the day before the dividend. Key dates include a cum‑ex dividend on Nov 7 and 10, cash market on Nov 11 and 12, and the dividend distribution on Nov 25, 2025, while SPMA shares have risen 7.64% to Rp310 per share.",
        "source": "https://emitennews.com/news/spma-minta-restu-bagikan-dividen-saham-rasio-10030",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Dividend Announcement",
            "Bullish"
        ],
        "tickers": [
            "SPMA.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 2,
            "valuation": 2,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 96
    },
    {
        "id": 7816,
        "created_at": "2025-09-24T04:32:18.934846+00:00",
        "title": "PT Maha Properti Indonesia Tbk. Announces Sale of All Shares in PT Bintang Express Sarana for Rp320 Billion",
        "body": "PT Maha Properti Indonesia Tbk. disclosed that PT Bintang Express Sarana has sold its entire 640 million shareholding at Rp500 per share, a transaction totaling Rp320 billion, thereby reducing its stake from 6.44 % to 0 %. The sale follows a period of significant share price volatility, with Mpro shares suspended on 19 September 2025 after a 45.77 % monthly rise and a 147.5 % six‑month increase.",
        "source": "https://emitennews.com/news/bintang-express-lepas-saham-properti-keluarga-sri-tahir-mpro-rp320m",
        "timestamp": "2025-09-23T00:00:00",
        "sector": "properties-real-estate",
        "sub_sector": [
            "properties-real-estate"
        ],
        "tags": [
            "Ownership",
            "Suspension",
            "Bullish"
        ],
        "tickers": [
            "MPRO.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7831,
        "created_at": "2025-09-25T04:20:36.801134+00:00",
        "title": "PT Abadi Nusantara Hijau Investama Tbk Announces Shift to Holding Structure and Asset Expansion",
        "body": "PT Abadi Nusantara Hijau Investama Tbk (formerly PT Solusi Kemasan Digital Tbk) is discontinuing its plastic packaging retail and industrial operations and converting into a holding company, with operating activities to be handled by its subsidiaries. Its consolidated assets are projected to rise from Rp70.47 billion to Rp2.83 trillion through mining investments, while financial ratios become more aggressive (ROA 0.57 %, ROE 21.21 %, net margin 78.39 %, current ratio 0.03x, debt‑asset ratio 0.98x, debt‑equity ratio 36.27x), and the company will seek shareholder approval at its AGM on 25 September 2025.",
        "source": "https://emitennews.com/news/pack-rencana-ubah-bisnis-jadi-perusahaan-investasi",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Shareholders General Meeting",
            "Financial Metrics",
            "Business Expansion"
        ],
        "tickers": [
            "PACK.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 91
    },
    {
        "id": 7832,
        "created_at": "2025-09-25T04:20:37.634885+00:00",
        "title": "Vale Indonesia Reshuffles Board, Appoints Slamet Sugiharto as Chief Strategy Technical Officer",
        "body": "At an extraordinary shareholders meeting in Jakarta, Vale Indonesia TBK approved the resignation of Luke Mahony from his dual role as director and chief strategy technical officer and elected Slamet Sugiharto to fill the position through the 2028 annual general meeting. The board also confirmed Abu Ashar as vice president director and chief operation infrastructure officer.",
        "source": "https://emitennews.com/news/vale-inco-umumkan-direktur-baru",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Executive Changes",
            "Shareholders General Meeting"
        ],
        "tickers": [
            "INCO.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 2,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7833,
        "created_at": "2025-09-25T04:20:37.634885+00:00",
        "title": "SSMS to Acquire 63.40% of PT Sawit Mandiri Lestari in Rp1.6 Trillion Deal",
        "body": "SSMS plans to acquire 98,328 shares (63.40%) of PT Sawit Mandiri Lestari for Rp1.6 trillion, a material transaction under OJK regulations, as part of its expansion strategy. The deal, involving seller PT Citra Borneo Indah and buyer SSMS, will be priced based on a fair value assessment and is expected to strengthen SSMS’s palm oil supply chain and operational efficiency.",
        "source": "https://emitennews.com/news/ssms-ungkap-rencana-akuisisi-kebun-sawit-rp16t",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Mergers & Acquisitions",
            "Business Expansion",
            "OJK",
            "Ownership"
        ],
        "tickers": [
            "SSMS.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 96
    },
    {
        "id": 7834,
        "created_at": "2025-09-25T04:20:37.634885+00:00",
        "title": "Director Lindataty Expands Stake in PT Ateliers Mecaniques d ’ indonesie tbk. to 0.31%",
        "body": "Lindataty, director of PT Ateliers Mecaniques d ’ indonesie tbk., increased his holdings to 3.35 million shares (0.31%) by buying 584,400 shares on 22 September 2025 and 300,000 shares on 18 September 2025 at prices between Rp214 and Rp224 per share. The company’s shares traded at Rp226 today, having risen 7.4% in the past month, 69.9% in six months, and 58% year‑to‑date.",
        "source": "https://emitennews.com/news/bos-amin-kembali-borong-saham-harga-bawah",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "industrials",
        "sub_sector": [
            "industrial-goods"
        ],
        "tags": [
            "Ownership",
            "Domestic Investor",
            "Bullish"
        ],
        "tickers": [
            "AMIN.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7835,
        "created_at": "2025-09-25T04:20:37.634885+00:00",
        "title": "PT Tirta Mahakam Resources plans to pivot from plywood to domestic shipping, buying 20 vessels for Rp162.09 billion financed by a Rp200 billion loan from controlling shareholder",
        "body": "PT Tirta Mahakam Resources Tbk, which has halted plywood operations since 2020, announced a strategic shift to domestic shipping, purchasing 20 tugs and barges for Rp162.09 billion from related parties and securing a Rp200 billion loan from PT Harita Jayaraya, allocating Rp180 billion for the vessels and Rp20 billion for working capital. The company will seek shareholder approval at an extraordinary general meeting on 25 September 2025, after its shares were suspended for nine months due to lack of significant operations.",
        "source": "https://emitennews.com/news/tirta-mahakam-tirt-ubah-haluan-ke-bisnis-angkutan-laut",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Asset Purchase",
            "Capital & Funding",
            "Shareholders General Meeting",
            "Suspension"
        ],
        "tickers": [
            "TIRT.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7817,
        "created_at": "2025-09-25T04:20:35.20717+00:00",
        "title": "Bank Mandiri’s Net Profit Outlook Slowed by One‑Off Operating Expenses, Leading to Revised Estimates by UOB Kay Hian",
        "body": "Bank Mandiri’s net profit is projected to grow more slowly than earlier estimates for 2025‑2026 due to a one‑off operating expense adjustment that pushed 2025 operating expenses up 20‑25%. UOB Kay Hian has cut its net profit estimate for Bank Mandiri by 10%, while management expects non‑recurring opex to normalize in 2026, with the cost‑to‑income ratio falling back to about 40% and return on equity stabilizing at 17‑18% versus the prior 19‑20% forecast.",
        "source": "https://asianbankingandfinance.net/retail-banking/news/bank-mandiris-net-profit-growth-slow-in-2025-due-opex-adjustment",
        "timestamp": "2025-09-24T07:34:57",
        "sector": "financials",
        "sub_sector": [
            "banks"
        ],
        "tags": [
            "Financial Metrics",
            "Analyst Ratings"
        ],
        "tickers": [
            "BMRI.JK"
        ],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 71
    },
    {
        "id": 7818,
        "created_at": "2025-09-25T04:20:35.20717+00:00",
        "title": "PT Amman Mineral Internasional Tbk Seeks Export Permit Extension as Smelter Nears Completion",
        "body": "PT Amman Mineral Internasional Tbk, a subsidiary of PT Amman Mineral and Freeport Indonesia, has requested the ESDM Ministry to extend its copper concentrate and cathode export permits—expired 31 December 2024—as its smelter, capable of producing 900,000 t of concentrate and 220,000 t of 99.99 % cathodes, nears completion and requires additional funding. The ministry is still evaluating the request, while industry groups urge a relaxation to avoid production and employment losses, noting the project’s IDR 21 trillion investment and 37,000 jobs.",
        "source": "https://indonesiaminer.com/news/detail/amman-mineral-extends-concentrate-exports-in-line-with-smelter-project-commitments",
        "timestamp": "2025-09-21T07:33:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Export",
            "Capital & Funding",
            "Business Expansion",
            "Government Policy",
            "Production & Operations"
        ],
        "tickers": [
            "AMMN.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 64
    },
    {
        "id": 7819,
        "created_at": "2025-09-25T04:20:35.20717+00:00",
        "title": "PT Adaro Minerals Indonesia to Begin Smelter Operations in 2025, Eyes Dividend Distribution",
        "body": "PT Adaro Minerals Indonesia announced that its aluminium smelter, being built by PT Kalimantan Aluminium Industry, will enter first pot operation by year‑end 2025 with an initial capacity of 500,000 t and plans to expand to 1.5 million t. Its subsidiary PT Alamtri Indo Aluminium has injected IDR 947.49 billion, raising total equity to IDR 4.91 trillion, and management is evaluating dividend payments for 2025 while prioritising debt repayment and capital expenditures, after the stock rose 3.30 % following the update.",
        "source": "https://indonesiaminer.com/news/detail/adaro-minerals-unit-targets-aluminium-smelter-start-up-by-end-of-2025",
        "timestamp": "2025-09-19T14:24:00",
        "sector": "energy",
        "sub_sector": [
            "oil-gas-coal"
        ],
        "tags": [
            "Business Expansion",
            "Dividend Announcement",
            "Capital & Funding",
            "Subsidiaries",
            "Bullish"
        ],
        "tickers": [
            "ADMR.JK"
        ],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 2,
            "valuation": 2,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 64
    },
    {
        "id": 7820,
        "created_at": "2025-09-25T04:20:35.20717+00:00",
        "title": "Untr’s Danusa Tambang Nusantara Acquisition of Arafura Surya Alam Adds Gold Project to Diversify Away from Coal",
        "body": "Untr’s subsidiary Danusa Tambang Nusantara has signed a conditional sale‑purchase agreement to acquire 100% of Arafura Surya Alam for USD 540 million, a transaction fully funded internally that lowers risk and limits FY25 dividend payout given IDR 15 trillion cash balance. The acquisition adds ASA’s IUPOP mining permit Doup project—an open‑pit gold concession with 3.1 M oz resources and 1.6 M oz reserves—to Untr’s portfolio, with projected FY28 production of 140–155 k oz and a net profit contribution of IDR 3.3 trillion, while the combined gold business is expected to add about IDR 10 trillion, supporting a positive outlook despite potential coal price risks.",
        "source": "https://indonesiaminer.com/news/detail/untrs-doup-project-to-boost-gold-production-beyond-400koz-by-fy28f-overall-transaction-outlook-positive",
        "timestamp": "2025-09-16T14:30:00",
        "sector": "infrastructures",
        "sub_sector": [
            "heavy-constructions-civil-engineering"
        ],
        "tags": [
            "Mergers & Acquisitions",
            "Asset Purchase",
            "Business Expansion",
            "Commodities",
            "Subsidiaries"
        ],
        "tickers": [
            "FIMP.JK"
        ],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 1,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 98
    },
    {
        "id": 7821,
        "created_at": "2025-09-25T04:20:35.20717+00:00",
        "title": "PT Merdeka Gold Resources Tbk Announces IPO to Raise IDR 4.88 Trillion for Pani Gold Project Expansion",
        "body": "PT Merdeka Gold Resources Tbk (through its subsidiary PT Merdeka Copper Gold Tbk) has launched an IPO offering 1.62 billion ordinary shares, aiming to raise approximately IDR 4.88 trillion, with proceeds earmarked for working capital and debt repayment. The company plans to use the funds to support its Pani Gold Project, which is projected to reach peak production of 500,000 ounces per year by 2030.",
        "source": "https://indonesiaminer.com/news/detail/pt-merdeka-gold-resources-tbk-officially-launches-ipo-to-support-pani-gold-project-in-gorontalo",
        "timestamp": "2025-09-16T04:48:00",
        "sector": "infrastructures",
        "sub_sector": [
            "heavy-constructions-civil-engineering"
        ],
        "tags": [
            "IPO",
            "Capital & Funding",
            "Business Expansion",
            "Production & Operations"
        ],
        "tickers": [
            "PTPP.JK"
        ],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 88
    },
    {
        "id": 7822,
        "created_at": "2025-09-25T04:20:35.991113+00:00",
        "title": "Antam to Build $70 Million Gold Minting Plant in Gresik Amid Strong First‑Half 2025 Performance",
        "body": "PT Aneka Tambang Tbk (antam) is launching a $70 million gold minting plant in Gresik, East Java, slated to start operations in Q4 2027 and produce up to 5 million gold bars and coins annually, as part of Indonesia’s downstreaming push to reduce gold imports. The move follows a 154.57 % jump in first‑half 2025 sales to IDR 59.01 trillion, a 202.58 % rise in net profit to IDR 4.69 trillion, and a 128 % YTD share price surge, with analysts projecting 2025 net profit near IDR 9 trillion and a target price of IDR 3,850 per share.",
        "source": "https://indonesiaminer.com/news/detail/aneka-tambang-enters-a-new-phase-in-gold-downstreaming",
        "timestamp": "2025-09-15T14:14:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Business Expansion",
            "Production & Operations",
            "Government Policy",
            "Financial Metrics",
            "Bullish"
        ],
        "tickers": [
            "ANTM.JK"
        ],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 1,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 73
    },
    {
        "id": 7823,
        "created_at": "2025-09-25T04:20:35.991113+00:00",
        "title": "Michael Wong reduces Astrindo Nusantara stake by 8.4 million shares in September 2025",
        "body": "Michael Wong, director of Astrindo Nusantara, sold 8.4 million shares of Astrindo Nusantara between 18‑19 September 2025 at prices ranging from Rp82.66 to Rp84 per share, realizing Rp697.56 million in proceeds and leaving him with 1.5 million shares (0% stake). The divestment was for personal direct ownership purposes, according to corporate secretary Tukas Kurniawan Budiman of Astrindo Nusantara Infrastruktur.",
        "source": "https://emitennews.com/news/bos-bipi-lego-84-juta-lembar-telisik-tujuannya",
        "timestamp": "2025-09-25T00:00:00",
        "sector": "energy",
        "sub_sector": [
            "oil-gas-coal"
        ],
        "tags": [
            "Ownership"
        ],
        "tickers": [
            "BIPI.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 96
    },
    {
        "id": 7824,
        "created_at": "2025-09-25T04:20:35.991113+00:00",
        "title": "Company Announces Rp56 billion Share Buyback of 103.7 million Shares at Up to Rp760 Each from 23 September to 22 December 2025",
        "body": "The company will repurchase 103,703,000 shares—0.35% of its outstanding shares—using Rp56 billion from internal cash, with a maximum price of Rp760 per share, and will hold the shares as treasury stock. The buyback, conducted by Mandiri Sekuritas, is expected to have no significant impact on the company’s financial position or earnings.",
        "source": "https://emitennews.com/news/lanjut-sido-muncul-sido-buyback-rp56-miliar",
        "timestamp": "2025-09-25T00:00:00",
        "sector": "healthcare",
        "sub_sector": [
            "pharmaceuticals-health-care-research"
        ],
        "tags": [
            "Stock Buyback"
        ],
        "tickers": [
            "SIDO.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 91
    },
    {
        "id": 7825,
        "created_at": "2025-09-25T04:20:35.991113+00:00",
        "title": "Indah Kiat to Issue Rp5.26 Trillion in Bonds, Sukuk, and USD Notes by October 2025",
        "body": "Indah Kiat will launch a Rp5.26 trillion debt package on the Indonesian Stock Exchange on 1 October 2025, comprising Rp3.94 trillion sustainable bonds, Rp1.1 trillion sukuk mudharabah, and USD12.51 million in dollar‑denominated bonds. The proceeds will be used to repay existing loans and fund working capital, with coupon payments ranging from 9% to 9.5% on bonds and a 9.5% profit‑sharing rate on the sukuk, and first payments scheduled for 30 December 2025.",
        "source": "https://emitennews.com/news/hari-ini-grup-sinarmas-inkp-mulai-tawarkan-obligasi-jumbo",
        "timestamp": "2025-09-25T00:00:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Debt Issuance",
            "Bonds",
            "Sharia Economy",
            "Capital & Funding"
        ],
        "tickers": [
            "INKP.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 1
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7826,
        "created_at": "2025-09-25T04:20:35.991113+00:00",
        "title": "Koka Indonesia Management Confirms Acquisition Plan by Ningbo Lixing Enterprise Management Co. Still in Planning Stage",
        "body": "Koka Indonesia’s management stated that the proposed acquisition by Ningbo Lixing Enterprise Management Co., Ltd. remains in the planning phase, with Ningbo holding no shares and the target acquisition of 63.5% of Koka’s shares still subject to further discussion and regulatory approval. The company emphasized that Ningbo will not replace the current controller Gao Jing but will operate jointly, and both parties intend to comply with Indonesian securities regulations and seek approvals from the Indonesia Stock Exchange, OJK, and other authorities.",
        "source": "https://emitennews.com/news/proses-akuisisi-gao-jing-ningbo-pengendali-koka",
        "timestamp": "2025-09-25T00:00:00",
        "sector": "infrastructures",
        "sub_sector": [
            "heavy-constructions-civil-engineering"
        ],
        "tags": [
            "Mergers & Acquisitions",
            "Foreign Investment",
            "OJK"
        ],
        "tickers": [
            "KOKA.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 91
    },
    {
        "id": 7827,
        "created_at": "2025-09-25T04:20:36.801134+00:00",
        "title": "Director Wong Michael sells 6 million BIPI shares, cutting stake to 0.01%",
        "body": "Director Wong Michael of pt astrindo nusantara infrastruktur tbk. sold 6,000,000 BIPI shares at an average price of Rp82.66 per share, reducing his ownership to about 3.9 million shares (0.01% of the company). The sale follows a prior purchase of 24,139,700 shares at Rp88.73 each, and the BIPI share price fell 2.38% to Rp82 at Thursday's close.",
        "source": "https://emitennews.com/news/bos-bipi-lepas-6-juta-lembar-harga-pasar",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "energy",
        "sub_sector": [
            "oil-gas-coal"
        ],
        "tags": [
            "Ownership",
            "Bearish"
        ],
        "tickers": [
            "BIPI.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 2,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7828,
        "created_at": "2025-09-25T04:20:36.801134+00:00",
        "title": "PT Modern Internasional Tbk. and Genertec International Holding Co., Ltd. Sign Non‑Binding MOU to Expand Health‑Tech Collaboration",
        "body": "PT Modern Internasional Tbk. (mdrn) and Genertec International Holding Co., Ltd. signed a non‑binding memorandum of understanding on September 18, 2025, to collaborate on CNC machinery, medical equipment, smart hospital software, IoT health tech, and pharmaceuticals. Following the announcement, mdrn shares rose 9.09% to Rp60.",
        "source": "https://emitennews.com/news/mdrn-gandeng-bumn-tiongkok-perluas-bisnis",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "industrials",
        "sub_sector": [
            "industrial-services"
        ],
        "tags": [
            "MoU",
            "Partnerships & Agreements",
            "Business Expansion",
            "Digital Transformation",
            "Bullish"
        ],
        "tickers": [
            "MDRN.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 2,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7829,
        "created_at": "2025-09-25T04:20:36.801134+00:00",
        "title": "PT Samuel Tumbuh Bersama sells 35.7 million shares of PT Nusantara Sawit Sejahtera Tbk, reducing stake from 33.13% to 32.98%",
        "body": "PT Samuel Tumbuh Bersama sold 35,714,300 shares of PT Nusantara Sawit Sejahtera Tbk at Rp420 per share, cutting its direct ownership from 7,885,653,500 shares (33.13%) to 7,849,939,200 shares (32.98%). The shares closed at Rp492 on the day, up 0.41%, with the company’s share price up 15.5% in the last month, 83.5% in the last six months, and 72% year‑to‑date.",
        "source": "https://emitennews.com/news/pengendali-nsss-lepas-357-juta-saham-ada-apa",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Ownership",
            "Bullish"
        ],
        "tickers": [
            "NSSS.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 1,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7830,
        "created_at": "2025-09-25T04:20:36.801134+00:00",
        "title": "PT Kencana Energi Lestari Tbk Clarifies Stock Volatility Amid 2024 Losses and Share Sale by Director",
        "body": "PT Kencana Energi Lestari Tbk said its shares, which rose 3.1% to Rp1,005 on Wednesday, were affected only by market dynamics, with no material information or planned corporate actions, and reported a 51.74% drop in 2024 net profit to USD6.23 million, a 21% decline in revenue to USD37.86 million, and a share price decline to USD0.0017. Director Rusmin Cahyadi sold 155,000 shares at Rp893.39 each, while the company’s main shareholder had no special plans for its holdings.",
        "source": "https://emitennews.com/news/bei-telisik-kencana-energi-keen-laba-drop-saham-melonjak",
        "timestamp": "2025-09-24T00:00:00",
        "sector": "infrastructures",
        "sub_sector": [
            "utilities"
        ],
        "tags": [
            "Financial Metrics",
            "Market Sentiment",
            "Ownership",
            "Bullish"
        ],
        "tickers": [
            "KEEN.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 2,
            "valuation": 1,
            "financials": 2,
            "management": 1,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
     {
        "id": 7878,
        "created_at": "2025-09-27T04:34:38.801343+00:00",
        "title": "Indonesia Issues 1,012 Golden Visas, Attracting Over Rp48 Trillion in Investment in September 2025",
        "body": "The Directorate General of Immigration at the Ministry of Immigration Correction granted 1,012 Indonesian Golden Visas in September 2025, bringing in more than Rp48 trillion in investment and generating Rp12.96 billion in non‑tax state revenue. The visas, issued to holders from 61 countries, include large corporate investments of Rp46.5 trillion (96% of total) and smaller individual investments of Rp249.3 billion.",
        "source": "https://en.antaranews.com/news/382641/immigration-grants-1012-golden-visas-investment-hits-rp48-trillion",
        "timestamp": "2025-09-26T15:08:00",
        "sector": "financials",
        "sub_sector": [
            "investment-service"
        ],
        "tags": [
            "Foreign Investment"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7879,
        "created_at": "2025-09-27T04:34:38.801343+00:00",
        "title": "Bank Indonesia Deploys Multiple Instruments to Stabilize Rupiah Amid Dollar Weakening",
        "body": "Bank Indonesia reaffirmed its commitment to keep the rupiah stable after it fell to around Rp16,700 per dollar, announcing spot market operations, non-deliverable forwards, and government securities purchases. The central bank also intervened in overseas markets and urged market participants to cooperate, as the rupiah traded between Rp16,600 and Rp16,700, slipping 0.15% to Rp16,775 on Friday.",
        "source": "https://en.antaranews.com/news/382621/bank-indonesia-steps-up-measures-to-stabilize-rupiah",
        "timestamp": "2025-09-26T14:15:00",
        "sector": "financials",
        "sub_sector": [
            "banks"
        ],
        "tags": [
            "Central Bank",
            "Currency & FX",
            "Forex",
            "Bonds",
            "Government Policy"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 68
    },
    {
        "id": 7880,
        "created_at": "2025-09-27T04:34:38.801343+00:00",
        "title": "Indonesia and Canada Aim to Fast‑Track CEPA to Boost Trade and Investment by Mid‑2026",
        "body": "Indonesia’s trade minister Budi Santoso and Canadian International Trade Minister Maninder Sidhu met in Ottawa to discuss accelerating the ratification of the Comprehensive Economic Partnership Agreement (CEPA), hoping to bring the deal into effect by mid‑2026 and expand market access for Indonesian goods and services in North America. Both sides agreed to promote the pact through chambers of commerce, set up an implementation team, and focus on infrastructure, transportation, telecommunications, and technical cooperation to improve food‑safety standards and competitiveness.",
        "source": "https://en.antaranews.com/news/382605/indonesia-hopes-cepa-with-canada-will-fast-track-trade-and-investment",
        "timestamp": "2025-09-26T13:08:00",
        "sector": "infrastructures",
        "sub_sector": [
            "transportation-infrastructure"
        ],
        "tags": [
            "Export",
            "Government Policy",
            "Partnerships & Agreements",
            "Global Economy",
            "Business Expansion"
        ],
        "tickers": [],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7881,
        "created_at": "2025-09-27T04:34:38.801343+00:00",
        "title": "UBS Group AG Increases Bumi Resources Stake to 7.06% by Purchasing 421.36 Million Shares",
        "body": "UBS Group AG bought 421,364,400 Bumi Resources shares at Rp119.0982 each, spending Rp50.18 billion, raising its holding to 26.22 billion shares (7.06%)—an increase of 0.11 percentage points—under a client hedging derivative arrangement.",
        "source": "https://emitennews.com/news/ubs-ag-gulung-42136-juta-saham-bumi-rp5018-miliar",
        "timestamp": "2025-09-27T00:00:00",
        "sector": "energy",
        "sub_sector": [
            "oil-gas-coal"
        ],
        "tags": [
            "Foreign Investment",
            "Ownership",
            "Asset Management"
        ],
        "tickers": [
            "BUMI.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 1,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7886,
        "created_at": "2025-09-27T04:34:39.078328+00:00",
        "title": "PT Xolare RCR Energy TBK. Director Increases Sola Shareholding to 3.82%",
        "body": "Mochamad Bhadaiwi, the CEO and controlling shareholder of PT Xolare RCR Energy TBK., purchased 1,000,000 shares of Sola at Rp125 each, raising his stake from 3.79% to 3.82%. Sola shares rose 4.80% to Rp131 on the day of the transaction.",
        "source": "https://emitennews.com/news/bos-sola-rajin-serok-saham-harga-bawah-ada-apa",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Ownership",
            "Market Sentiment",
            "Domestic Investor",
            "Bullish"
        ],
        "tickers": [
            "SOLA.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 2,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7887,
        "created_at": "2025-09-27T04:34:39.351279+00:00",
        "title": "PT Total Bangun Persada Tbk Announces Expansion into New Construction Sectors Ahead of Extraordinary AGM",
        "body": "totl plans to add 10 new Indonesian Standard Industrial Classification categories covering telecommunications, water infrastructure, ports, mining, oil and gas, geothermal, sports facilities, chemical processing, and other civil construction to clarify its business scope and align regulations. Shares surged 12.42% (95 points) to Rp865 in the intraday session.",
        "source": "https://emitennews.com/news/totl-beber-rencana-ekspansi-sahamnya-melambung",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "infrastructures",
        "sub_sector": [
            "heavy-constructions-civil-engineering"
        ],
        "tags": [
            "Business Expansion",
            "Risk & Compliance",
            "Bullish"
        ],
        "tickers": [
            "TOTL.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 2,
            "valuation": 2,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 71
    },
    {
        "id": 7867,
        "created_at": "2025-09-27T04:34:37.47169+00:00",
        "title": "Indonesia and EU Complete CEPA Negotiations, Setting Stage for Zero‑Tariff Palm Oil Exports Amid Deforestation Compliance Concerns",
        "body": "Indonesia and the European Union have finished negotiations on the Comprehensive Economic Partnership Agreement, slated for announcement on 23 September 2025, which will grant zero tariffs to Indonesian palm oil derivatives and allow 80% of Indonesian goods to enter the EU without duty. However, exporters must still meet the EU Deforestation Regulation, and the agreement’s implementation will require extensive legal review before it takes effect.",
        "source": "https://gapki.id/en/news/2025/09/26/gapki-ieu-cepa-useless-without-fulfilling-eu-standards/",
        "timestamp": "2025-09-26T11:06:57",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Export",
            "Tariff & VAT",
            "Global Economy",
            "Government Policy"
        ],
        "tickers": [],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 1
        },
        "votes": null,
        "score": 71
    },
    {
        "id": 7836,
        "created_at": "2025-09-26T04:52:11.39504+00:00",
        "title": "Indonesian Palm Oil Association Highlights Legal, Export, and Price Challenges Amid EU Deforestation Rules",
        "body": "Chairman Eddy Martono of the Indonesian palm oil association said that while direct conflicts with indigenous peoples are rare, legal issues arise from forest encroachment and EU deforestation rules that could hurt exports, and he noted a dilemma between meeting the 14 million‑ton biodiesel mandate and allowing CPO exports. He projected CPO prices to stay around US$1,100–1,200/ton, possibly reaching US$1,300, and highlighted that national banks could absorb Rp200 trillion in financing for the sector.",
        "source": "https://gapki.id/en/news/2025/09/23/gapki-forests-rules-and-eudr-haunting-palm-industries/",
        "timestamp": "2025-09-26T10:27:31",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Export",
            "Commodities",
            "Capital & Funding",
            "Government Policy",
            "Risk & Compliance"
        ],
        "tickers": [],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 2
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7837,
        "created_at": "2025-09-26T04:52:11.39504+00:00",
        "title": "PT Perkebunan Nusantara IV Palmco Launches First Indonesian Compressed Biomethane Plant Using Palm Oil Waste",
        "body": "PT Perkebunan Nusantara IV Palmco, in partnership with Malaysian firm PT Renikola Primer Energi, has begun development of Indonesia’s first compressed biomethane plant that will process liquid palm oil waste into 162,000 mmbtu of gas per year, cutting CO₂ emissions by 30,000 tons annually and is slated to start full operation in Q4 2026 under a 10‑year build‑own‑operate‑transfer contract with PT Pertagas Niaga. The project aligns with Palmco’s decarbonization roadmap, which targets a 54.46 % emissions reduction by 2030 and plans to roll out 20 similar plants.",
        "source": "https://gapki.id/en/news/2025/09/21/ri-develops-first-biogas-plant-based-on-palm-oil-waste/",
        "timestamp": "2025-09-26T09:55:13",
        "sector": "energy",
        "sub_sector": [
            "alternative-energy"
        ],
        "tags": [
            "ESG",
            "Business Expansion",
            "Production & Operations",
            "Partnerships & Agreements"
        ],
        "tickers": [],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 2
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7838,
        "created_at": "2025-09-26T04:52:11.39504+00:00",
        "title": "Indonesia Delays Decision on Upgrading Biodiesel Mandate to B50 Pending Trial Results",
        "body": "Indonesia’s Energy and Mineral Resources Minister Bahlil Lahadalia said the government will only confirm whether to upgrade the mandatory biodiesel blend from B40 to B50 (or B45 first) after the ongoing B50 trial concludes, which is now in its third stage. The trial, expected to take six to eight months, will assess engine durability using palm‑oil biodiesel, while the mining sector warns that the current B40 mandate already burdens industry.",
        "source": "https://gapki.id/en/news/2025/09/18/trial-still-unfinished-b50-not-yet-ready-to-go-in-2026/",
        "timestamp": "2025-09-26T08:47:23",
        "sector": "energy",
        "sub_sector": [
            "alternative-energy"
        ],
        "tags": [
            "Government Policy",
            "Ministry",
            "Pilot Project",
            "Commodities"
        ],
        "tickers": [],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 1
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7839,
        "created_at": "2025-09-26T04:52:11.39504+00:00",
        "title": "Indonesia and Canada Sign Landmark Trade Pact Granting Broad Preferential Access to Each Other’s Markets",
        "body": "Indonesia and Canada signed the ICA‑CEPA, giving over 90% of Indonesian goods—such as textiles, footwear, furniture, processed foods, light electronics, automotive components and bird’s nests—preferential access to Canada, while Indonesia opens 85.54% of its market to Canadian products like frozen beef, wheat, potatoes and seafood. Bilateral trade between January and July 2025 rose to $2.72 billion, a 30% increase from the same period in 2024.",
        "source": "https://en.antaranews.com/news/382529/indonesia-canada-enter-new-chapter-in-trade-through-ica-cepa",
        "timestamp": "2025-09-25T20:05:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Export",
            "Import",
            "Government Policy",
            "Global Economy"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7840,
        "created_at": "2025-09-26T04:52:11.39504+00:00",
        "title": "Indonesia Urges Global Mineral Players to Support In-Country Downstreaming to Boost Economy",
        "body": "Indonesia’s Deputy Minister of Investment, Todotua Pasaribu, called on international mining firms to keep all raw‑material processing within the country, citing a projected 193.8 trillion rupiah investment in downstream projects by September 2025, led by nickel at 94.1 trillion rupiah. The government aims to create jobs and long‑term economic benefits by improving permits, fiscal incentives, and fostering a more investor‑friendly environment.",
        "source": "https://en.antaranews.com/news/382497/indonesia-pushes-mineral-downstreaming-to-boost-economy",
        "timestamp": "2025-09-25T18:58:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Business Expansion",
            "Capital & Funding",
            "Foreign Investment",
            "Government Policy",
            "Commodities"
        ],
        "tickers": [],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7841,
        "created_at": "2025-09-26T04:52:12.069703+00:00",
        "title": "Indonesia's Marine Affairs Minister Calls for Accelerated Blue Economy Rollout and Appoints New Senior Officials",
        "body": "Sakti Wahyu Trenggono, Indonesia’s Minister of Marine Affairs and Fisheries, inaugurated new senior officials—Inspector General Ade Tajudin Sutiawarman and Director General of Capture Fisheries Lotharia Latif—while urging faster implementation of blue‑economy programs, tighter oversight, and development of coastal fishing villages to boost welfare and food security. He emphasized the need for swift action and continuous evaluation to ensure policies deliver tangible benefits to coastal communities.",
        "source": "https://en.antaranews.com/news/382465/minister-urges-faster-rollout-of-indonesias-blue-economy-programs",
        "timestamp": "2025-09-25T17:55:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Executive Changes",
            "Government Policy"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 2,
            "sustainability": 1
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7842,
        "created_at": "2025-09-26T04:52:12.069703+00:00",
        "title": "Indonesia and EU Reach Final Agreement on Comprehensive Economic Partnership, Slashing Up to 98% Tariffs",
        "body": "Indonesia’s trade minister Budi Santoso announced that the Indonesia‑EU Comprehensive Economic Partnership Agreement (CEPA) has been substantively completed, with the pact set to eliminate up to 98% of tariffs and remove most trade barriers, and is expected to be signed in 2026, ratified, and implemented by January 2027. The agreement, which boosts market access for sectors such as palm oil, textiles, and services, follows a 4.34% rise in Indonesia‑EU trade to $18 billion in the first half of 2025, up from $30.4 billion in 2024.",
        "source": "https://en.antaranews.com/news/382329/indonesia-eu-finalize-i-eu-cepa-talks-toward-balanced-pact-minister",
        "timestamp": "2025-09-25T15:22:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Tariff & VAT",
            "Export",
            "Global Economy",
            "Government Policy"
        ],
        "tickers": [],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 76
    },
    {
        "id": 7843,
        "created_at": "2025-09-26T04:52:12.069703+00:00",
        "title": "Indonesia and Canada Sign Comprehensive Economic Partnership Agreement, Eliminating Major Tariffs",
        "body": "Indonesia and Canada signed the ICA‑CEPA at Parliament Hill, Ottawa, agreeing to eliminate 90.5% of Canadian tariffs and 85.8% of Indonesian tariff lines, a move expected to lift Indonesian exports to Canada to $11.8 billion by 2030 and boost investment by 0.38% of GDP. The signing also included defense and trade investment memoranda, marking a broadening of bilateral cooperation.",
        "source": "https://en.antaranews.com/news/382304/ica-cepa-signed-indonesia-and-canada-boost-trade-relations",
        "timestamp": "2025-09-25T12:30:00",
        "sector": "financials",
        "sub_sector": [
            "investment-service"
        ],
        "tags": [
            "Export",
            "Tariff & VAT",
            "Foreign Investment",
            "Government Policy"
        ],
        "tickers": [],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 81
    },
    {
        "id": 7844,
        "created_at": "2025-09-26T04:52:12.069703+00:00",
        "title": "Indonesia Extends 100% VAT Relief on Housing Purchases Through 2026",
        "body": "Indonesia will continue to cover 100% of the value‑added tax on housing purchases from January to December 2026, extending the full‑exemption policy that was originally limited to 2025. The measure, capped at 2 billion rupiah per home for properties priced up to 5 billion rupiah, aims to support middle‑class demand, stimulate construction activity, and attract private investment.",
        "source": "https://en.antaranews.com/news/382204/ri-govt-to-extend-full-vat-relief-on-housing-through-2026",
        "timestamp": "2025-09-24T23:31:00",
        "sector": "properties-real-estate",
        "sub_sector": [
            "properties-real-estate"
        ],
        "tags": [
            "Tariff & VAT",
            "Government Policy",
            "Subsidies & Incentives"
        ],
        "tickers": [],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 71
    },
    {
        "id": 7845,
        "created_at": "2025-09-26T04:52:12.069703+00:00",
        "title": "Indonesia Launches Plantation Downstreaming Initiative to Create 1.6 Million Jobs",
        "body": "Indonesia’s agriculture ministry announced a Rp9.95 trillion downstreaming program that will generate 1.6 million jobs, with free seed distribution and a Rp1.6 trillion ratoon replanting scheme targeting 100,000 hectares—primarily sugarcane in East Java—while state‑owned firms such as PT Perkebunan Nusantara, Pupuk Indonesia Holding Company, and Bulog will lead implementation. The plan also removes borrowing limits for farmers and expands to other commodities like cocoa, coconut, coffee, cashew, pepper, and nutmeg.",
        "source": "https://en.antaranews.com/news/382196/indonesia-targets-16m-jobs-through-plantation-downstreaming",
        "timestamp": "2025-09-24T21:49:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Government Policy",
            "Commodities",
            "Subsidies & Incentives"
        ],
        "tickers": [],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7846,
        "created_at": "2025-09-26T04:52:12.768529+00:00",
        "title": "Indonesia's National Food Agency Absorbs Over 60,000 Tons of Sugar Using Rp1.5 Trillion from Danantara to Stabilize Prices",
        "body": "Indonesia's National Food Agency has absorbed over 60,000 tons of farmers' sugar using Rp1.5 trillion from the Sovereign Wealth Fund Danantara, leaving 21,000 tons to reach its 81,000‑ton target, with the sugar slated for distribution after the milling season to stabilize prices. The program, part of a broader food security price control effort, also saw ID Food absorb 92,830 tons of sugar by September 23, with the first phase funded by commercial banks and subsequent phases by Danantara, while Bapanas urges private firms to help absorb excess supply and police crack down on refined sugar entering consumer markets.",
        "source": "https://en.antaranews.com/news/382120/over-60000-tons-of-sugar-absorbed-with-rp15-trillion-from-danantara",
        "timestamp": "2025-09-24T17:41:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-staples-retailing"
        ],
        "tags": [
            "Government Policy",
            "Capital & Funding",
            "Subsidies & Incentives"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7847,
        "created_at": "2025-09-26T04:52:12.768529+00:00",
        "title": "Indonesia Accelerates Village Cooperative Program with New Funding and Operational Support",
        "body": "Cooperatives Minister Ferry Juliantono announced that the government’s KDMP program, which has created 80,000 village cooperatives nationwide, is entering its second operational phase with revised finance regulations that require state-owned banks to provide capital, while the Indonesian Cooperatives Council is urged to strengthen human resources and governance. The initiative aims to boost rural economies by enabling cooperatives to compete with state-owned and private enterprises and to provide affordable goods and services to villagers.",
        "source": "https://en.antaranews.com/news/382104/indonesia-sees-kdmp-as-path-to-restore-cooperatives-role-in-economy",
        "timestamp": "2025-09-24T16:38:00",
        "sector": "financials",
        "sub_sector": [
            "financing-service"
        ],
        "tags": [
            "Capital & Funding",
            "Government Policy"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7848,
        "created_at": "2025-09-26T04:52:12.768529+00:00",
        "title": "Indonesia and EU Sign Comprehensive Economic Partnership Agreement Slashing 98% of Tariffs",
        "body": "Indonesia and the European Union signed the Indonesia–EU Comprehensive Economic Partnership Agreement, which will eliminate over 98% of tariffs on traded goods and is set to take effect on January 1, 2027 after parliamentary ratification. The deal aims to boost Indonesian exports—particularly labor‑intensive sectors such as palm oil, coffee, textiles, and electronics—by up to 2.5 times within five years, while granting Indonesian products near‑zero tariffs on almost 90% of the EU market.",
        "source": "https://en.antaranews.com/news/381932/indonesia-eu-seal-historic-trade-pact-slashing-98-percent-of-tariffs",
        "timestamp": "2025-09-24T05:47:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Tariff & VAT",
            "Export",
            "Global Economy"
        ],
        "tickers": [],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7849,
        "created_at": "2025-09-26T04:52:12.768529+00:00",
        "title": "Indonesia's Bursa Efek Suspends Trading of Five Stocks Amid Rapid Gains",
        "body": "The Indonesian Stock Exchange temporarily halted trading of PT Harta Djaya Karya Tbk, PT Jaya Sukses Makmur Sentosa Tbk, PT Grahaprima Suksesmandiri Tbk, PT Geoprima Solusi Tbk, and PT Futura Energi Global Tbk to protect investors and maintain market integrity, after each had posted significant weekly and monthly gains ranging from 25% to 155%. PT Futura Energi Global Tbk also saw a 669% rise over three months.",
        "source": "https://emitennews.com/news/lima-saham-meroket-ratusan-persen-disetop",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "consumer-cyclicals",
        "sub_sector": [
            "media-entertainment",
            "industrial-goods",
            "properties-real-estate",
            "household-goods",
            "logistics-deliveries"
        ],
        "tags": [
            "Suspension",
            "Bullish"
        ],
        "tickers": [
            "RISE.JK",
            "GTRA.JK",
            "MEJA.JK",
            "FUTR.JK",
            "GPSO.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 2,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7850,
        "created_at": "2025-09-26T04:52:12.768529+00:00",
        "title": "PT Lovina Beach Brewery TBK and PT Tourindo Guide Indonesia TBK Exit Full Call Auction on Sep 26, 2025",
        "body": "PT Lovina Beach Brewery TBK and PT Tourindo Guide Indonesia TBK were removed from the full call auction list effective September 26, 2025, after experiencing significant price surges—STRK up 28.9% in a month and 340% over six months, and PGJO up 710% over six months. Following the removal, STRK opened 1.87% higher at Rp218, while PGJO fell to the ARB floor, down 9.79% to Rp875.",
        "source": "https://emitennews.com/news/dua-saham-terbang-keluar-dari-fca-nasibnya-beda",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage",
            "software-it-services"
        ],
        "tags": [
            "Suspension",
            "Market Sentiment",
            "Neutral"
        ],
        "tickers": [
            "STRK.JK",
            "PGJO.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 2,
            "valuation": 1,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7851,
        "created_at": "2025-09-26T04:52:13.563381+00:00",
        "title": "Bank Aladin Syariah to Offer Rp500 Billion Sukuk Wakalah as Part of Rp2 Trillion Sustainable Sukuk Program",
        "body": "Bank Aladin Syariah will launch a Rp500 billion Sukuk Wakalah (Phase I) with a 370‑day maturity, quarterly profit‑sharing payments from February to November 2026, and proceeds earmarked for financing activities under Indonesian capital market rules. The public offering runs from 13–17 November 2025, with allocation on 18 November, refund on 20 November, electronic distribution on 20 November, and listing on 21 November 2025.",
        "source": "https://emitennews.com/news/genjot-pembiayaan-bank-tawarkan-sukuk-wakalah-rp500-miliar",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "financials",
        "sub_sector": [
            "banks"
        ],
        "tags": [
            "Bonds",
            "Debt Issuance",
            "Capital & Funding",
            "Sharia Economy"
        ],
        "tickers": [
            "BANK.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 1
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7852,
        "created_at": "2025-09-26T04:52:13.563381+00:00",
        "title": "Cisadane Sawit Raya Announces Interim Dividend of Rp12.2 per Share for 2025",
        "body": "Cisadane Sawit Raya will distribute an interim dividend of Rp25.01 billion, equivalent to Rp12.2 per share, based on 18% of net profit of Rp142.05 billion for the first half of 2025. The dividend will be paid on 24 October 2025, with ex‑dividend dates set for 7 and 9 October and the shareholder list deadline on 8 October at 16:00 WIB.",
        "source": "https://emitennews.com/news/csra-tabur-dividen-interim-rp2501-m-ikuti-jadwalnya",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-beverage"
        ],
        "tags": [
            "Dividend Announcement",
            "Financial Metrics"
        ],
        "tickers": [
            "CSRA.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7853,
        "created_at": "2025-09-26T04:52:13.563381+00:00",
        "title": "Zyrexindo Mandiri Buana Secures Export Import Facilitation from Indonesian Tax Authority to Boost Global Competitiveness",
        "body": "On August 28, 2025, Zyrexindo Mandiri Buana was granted an import facilitation for export by the Directorate General of Customs and Excise, following its first export announcement to the United States. The exemption from customs duty, VAT, and luxury tax on imported raw materials and components is expected to significantly lower production costs and enhance the company's competitiveness in international markets.",
        "source": "https://emitennews.com/news/zyrexindo-zyrx-ungkap-capaian-baru",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "technology",
        "sub_sector": [
            "technology-hardware-equipment"
        ],
        "tags": [
            "Import",
            "Export",
            "Tariff & VAT",
            "Business Expansion"
        ],
        "tickers": [
            "ZYRX.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7854,
        "created_at": "2025-09-26T04:52:13.563381+00:00",
        "title": "Astra International Expands Stake in Hermina Hospital Group to 20.09% Through Sequential Share Acquisitions",
        "body": "Astra International, via Astra Healthcare Indonesia, purchased 10 million shares of Hermina Hospital Group in two transactions on 23 and 24 September 2025, raising its indirect holding to 1.97 billion shares (12.86%). Combined with a prior 2.97 million‑share purchase on 19 September 2025, Astra’s total direct and indirect stake now totals 3.08 billion shares, equivalent to 20.09% of the company.",
        "source": "https://emitennews.com/news/kian-agresif-astra-group-asii-kembali-jaring-10-juta-saham-heal",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "industrials",
        "sub_sector": [
            "multi-sector-holdings"
        ],
        "tags": [
            "Ownership"
        ],
        "tickers": [
            "ASII.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 91
    },
    {
        "id": 7855,
        "created_at": "2025-09-26T04:52:13.563381+00:00",
        "title": "Bank BTN to Spin Off Its Sharia Unit into Bank Syariah Nasiona Ahead of 2025 AGM",
        "body": "Bank BTN has met the regulatory threshold with its unit usaha syariah (UUS BTN) assets at Rp54.3 trillion (Rp65.56 trillion in the first half of 2025) and will transfer the unit to Bank Syariah Nasiona, a move approved by OJK under the 2023 regulations. The spin‑off aligns with the rapid growth of Indonesia’s sharia banking sector, which saw assets rise 13.74% annually and market share reach 7.72% of national banking by December 2024.",
        "source": "https://emitennews.com/news/izin-investor-bbtn-kebut-spin-off-unit-usaha-syariah",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "financials",
        "sub_sector": [
            "banks"
        ],
        "tags": [
            "Sharia Economy"
        ],
        "tickers": [
            "BBTN.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7856,
        "created_at": "2025-09-26T04:52:14.356328+00:00",
        "title": "Merdeka Battery Materials reports Q1 2025 net loss of USD 5.85 million, a 71.3% decline from the same period last year",
        "body": "Merdeka Battery Materials posted a net loss of USD 5.85 million for Q1 2025, down 71.3% from USD 20.39 million in the same quarter last year, while revenue fell 31.9% to USD 627.7 million. The company’s gross profit dropped to USD 49.33 million, operating loss widened to USD 35.85 million, and total liabilities rose to USD 1.15 billion against equity of USD 2.32 billion.",
        "source": "https://emitennews.com/news/anjlok-7130-persen-laba-mbma-juni-2025-sisa-usd585-juta",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Financial Metrics"
        ],
        "tickers": [
            "MBMA.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7857,
        "created_at": "2025-09-26T04:52:14.356328+00:00",
        "title": "Prajogo Pangestu Divests 84.64 Million Shares of Barito Renewables Energy via Green Energy Pte Ltd in Silent Transaction",
        "body": "Prajogo Pangestu sold 84,640,500 shares of Barito Renewables Energy through Green Energy Pte Ltd on 24 September 2025, a transaction valued at Rp751.18 billion and supported by HSBC Indonesia, DBS Indonesia, and Citibank NA, reducing Nancy Pangestu’s stake in Green Energy to 21.92 percent. The divestment, aimed at increasing free float, left Green Energy with 29.32 billion shares outstanding.",
        "source": "https://emitennews.com/news/lagi-green-energy-divestasi-8464-juta-saham-bren",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "infrastructures",
        "sub_sector": [
            "utilities"
        ],
        "tags": [
            "Ownership",
            "Foreign Investment"
        ],
        "tickers": [
            "BREN.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7858,
        "created_at": "2025-09-26T04:52:14.356328+00:00",
        "title": "Merdeka Copper Gold Reports First‑Half 2025 Loss of USD15.8 Million, Revenue Down 21.9%",
        "body": "The company posted a first‑half loss of USD15.8 million, with revenue falling 21.9% to USD854.59 million and gross profit rising 19.4% to USD105.95 million. Operating profit increased 26.9% to USD78.88 million, but net income dropped 59.6% to USD8.29 million, while tax expense surged to USD16.37 million.",
        "source": "https://emitennews.com/news/makin-drop-paruh-pertama-2025-mdka-boncos-usd158-juta",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "infrastructures",
        "sub_sector": [
            "heavy-constructions-civil-engineering"
        ],
        "tags": [
            "Financial Metrics"
        ],
        "tickers": [
            "PTPP.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7859,
        "created_at": "2025-09-26T04:52:14.356328+00:00",
        "title": "PT Aviana Sinar Abadi Tbk Holds Extraordinary General Meeting to Approve Name Change to PT Folago Global Nusantara Tbk and New Board Structure Under New Majority Owner PT Matra Tri Abadi",
        "body": "The extraordinary general meeting approved the company’s name change to PT Folago Global Nusantara Tbk, relocation of its registered office, a new board of commissioners and directors led by PT Matra Tri Abadi, and a rights issue plan to issue up to 12,390,094,754 new shares and 1,858,514,214 Series II warrants. The proceeds are earmarked for expansion and working capital in the multi‑channel networking and social commerce digital ecosystem.",
        "source": "https://emitennews.com/news/ganti-nama-jadi-folago-global-nusantara-irsx-siapkan-aksi-korporasi",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "technology",
        "sub_sector": [
            "software-it-services"
        ],
        "tags": [
            "Rights Issue",
            "Business Expansion",
            "Capital & Funding",
            "Shareholders General Meeting",
            "Executive Changes"
        ],
        "tickers": [
            "IRSX.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 2,
            "sustainability": 0
        },
        "votes": null,
        "score": 86
    },
    {
        "id": 7860,
        "created_at": "2025-09-26T04:52:14.356328+00:00",
        "title": "Shareholder Kundy Wijaya reduces stake in PT Kusuma Kemindo Sentosa Tbk.",
        "body": "Kundy Wijaya sold roughly 2.07 million KKES shares at Rp41 each during September 2025, decreasing his holding to 98.3 million shares (6.56% of the company) from 100.403 million shares (6.69%). Director Melly Elita said the transactions were intended for divestment with direct share ownership.",
        "source": "https://emitennews.com/news/kurangi-porsi-kundy-wijaya-jual-satu-juta-saham-kusuma-kemindo-kkes",
        "timestamp": "2025-09-25T00:00:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Ownership"
        ],
        "tickers": [
            "KKES.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 1,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 68
    },
    {
        "id": 7888,
        "created_at": "2025-09-27T04:34:39.351279+00:00",
        "title": "PT Selamat Sempurna Tbk Receives MYR2.5 Million Cash Dividend from Malaysian Subsidiary Bradke Synergies Sdn. Bhd.",
        "body": "PT Selamat Sempurna Tbk (SMSM) received a MYR2.5 million cash dividend from its Malaysian subsidiary Bradke Synergies Sdn. Bhd. on 26 September 2025, a transaction that the company said has no material impact on its operations or financial condition, while the subsidiary’s 2015 acquisition for Rp220 billion remains part of SM​SM’s international expansion strategy.",
        "source": "https://emitennews.com/news/smsm-kantongi-setoran-dividen-anak-usaha-di-malaysia-myr25-juta",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "consumer-cyclicals",
        "sub_sector": [
            "automobiles-components"
        ],
        "tags": [
            "Dividend Announcement",
            "Business Expansion",
            "Subsidiaries"
        ],
        "tickers": [
            "SMSM.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7861,
        "created_at": "2025-09-26T04:52:15.032857+00:00",
        "title": "Lee Bee Teng cuts his holding in PT Primadaya Plastisindo Tbk to 5% after recent share sales",
        "body": "Lee Bee Teng sold 80,000 PT Primadaya Plastisindo Tbk shares at Rp560‑Rp580 each on 15‑16 April 2025, bringing his stake down to 153.06 million shares (5%). For the six‑month period ended 30 June 2025, the company reported net revenue of Rp232.73 billion, a higher gross profit of Rp39.93 billion, but lower profit before tax (Rp12.86 billion) and net profit (Rp9.88 billion) compared with the prior year, while assets rose to Rp645.97 billion and liabilities to Rp240.43 billion.",
        "source": "https://emitennews.com/news/jual-80-ribu-lembar-pemegang-saham-ini-kurangi-kepemilikan-di-pdpp",
        "timestamp": "2025-09-25T00:00:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Ownership",
            "Financial Metrics"
        ],
        "tickers": [
            "PDPP.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 1,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 74
    },
    {
        "id": 7862,
        "created_at": "2025-09-26T04:52:15.032857+00:00",
        "title": "Waskita Beton Precast Tbk completes CFADS Stage VI payment and advances debt‑to‑equity conversions, securing new contracts worth Rp757.79 bn",
        "body": "On 25 September 2025, wsbp paid the sixth CFADS installment of Rp110.75 billion, bringing total CFADS payments to Rp541.74 billion and adding a pro‑rata Rp1.59 billion from a non‑productive asset auction. The company has also converted trade‑creditor debt of Rp1.55 trillion (90.23% of the target) and previously converted bond debt of Rp1.85 trillion, while reporting new contracts in August 2025 amounting to Rp757.79 billion.",
        "source": "https://emitennews.com/news/wsbp-penuhi-kewajiban-pembayaran-cfads-tahap-vi-sesuai-jadwal",
        "timestamp": "2025-09-25T00:00:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Bonds",
            "Credit",
            "Capital & Funding"
        ],
        "tickers": [
            "WSBP.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 64
    },
    {
        "id": 7863,
        "created_at": "2025-09-26T04:52:15.032857+00:00",
        "title": "UBS Group AG sells nearly 100 million PT Bumi Resources Tbk shares, cutting its stake to below 7%",
        "body": "UBS Group AG offloaded about 61.09 million shares of PT Bumi Resources Tbk at an average price of IDR 112.71, reducing its holding from 7.01% to 6.99%, and subsequently sold two additional blocks of 20 million shares each, bringing its total stake to roughly 6.65%. The divestments were said to serve clients’ derivative hedging needs, and PT Bumi Resources Tbk closed 2.01% lower at IDR 146.",
        "source": "https://emitennews.com/news/diam-diam-ubs-group-ag-buang-lagi-100-juta-saham-bumi",
        "timestamp": "2025-09-25T00:00:00",
        "sector": "energy",
        "sub_sector": [
            "oil-gas-coal"
        ],
        "tags": [
            "Institutional Investor",
            "Foreign Investment",
            "Asset Management",
            "Ownership",
            "Bearish"
        ],
        "tickers": [
            "BUMI.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 1,
            "technical": 0,
            "valuation": 1,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 91
    },
    {
        "id": 7889,
        "created_at": "2025-09-27T04:34:39.351279+00:00",
        "title": "Director Mochamad Arief Iskandar Purchases 279,200 Shares of PT Nanotech Indonesia Global Tbk, Raising Ownership to 0.0079%",
        "body": "Mochamad Arief Iskandar, a director at PT Nanotech Indonesia Global Tbk, bought 279,200 shares of Nano at prices ranging from Rp68 to Rp71, boosting his stake from 0.0014% to 0.0079% of the company. The transaction was described as an investment for direct ownership, while Nano’s shares fell 2.86% to Rp68 after a recent rebound from Rp37 to Rp81.",
        "source": "https://emitennews.com/news/bos-nano-koleksi-saham-saat-harga-turun",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "nondurable-household-products"
        ],
        "tags": [
            "Ownership",
            "Domestic Investor",
            "Bearish"
        ],
        "tickers": [
            "NANO.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7890,
        "created_at": "2025-09-27T04:34:39.351279+00:00",
        "title": "PT Asuransi Ramayana Tbk to Propose 20:1 Stock Dividend of Rp17.16 Billion on 4 November 2025",
        "body": "PT Asuransi Ramayana Tbk plans to distribute a 20:1 stock dividend worth Rp17.16 billion, equivalent to 60,856,768 new shares at Rp282 each, with the dividend to be approved at an extraordinary general meeting on 4 November 2025. The dividend will be paid on 5 December 2025, with related ex‑dividend dates set for 13 and 17 November and the cash dividend record date on 14 November.",
        "source": "https://emitennews.com/news/asrm-jadwalkan-pembagian-dividen-saham-rasio-201",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "financials",
        "sub_sector": [
            "insurance"
        ],
        "tags": [
            "Dividend Announcement",
            "Shareholders General Meeting"
        ],
        "tickers": [
            "ASRM.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 91
    },
    {
        "id": 7868,
        "created_at": "2025-09-27T04:34:37.47169+00:00",
        "title": "Indonesia and EU Sign Free Trade Agreement, Eliminating Over 98% of Tariff Lines and Projecting 2.5‑Fold Export Growth",
        "body": "Indonesia and the European Union have signed a comprehensive economic partnership agreement that will eliminate more than 98% of tariff lines, granting Indonesian goods zero tariffs on 90.4% of the EU market from January 2027. The pact is expected to boost Indonesian exports to the EU by 2.5 times over five years, raise public welfare by about US$2.8 billion, and double trade to roughly US$60 billion while also addressing non‑tariff barriers such as EU deforestation rules.",
        "source": "https://gapki.id/en/news/2025/09/25/news-roundup-ri-eu-seal-the-deal-on-tariffs-but-what-about-non-tariffs/",
        "timestamp": "2025-09-26T10:58:25",
        "sector": "transportation-logistic",
        "sub_sector": [
            "logistics-deliveries"
        ],
        "tags": [
            "Export",
            "Tariff & VAT",
            "Global Economy",
            "Government Policy"
        ],
        "tickers": [],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 1
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7869,
        "created_at": "2025-09-27T04:34:37.47169+00:00",
        "title": "Jakarta - Indonesia Stock Exchange to Review Free Float Regulations Ahead of Draft Release",
        "body": "Jakarta - Indonesia Stock Exchange will soon publish a draft of proposed adjustments to free float requirements, aiming to improve liquidity and market balance, while the financial services authority considers raising the minimum free float from 7% to 10% and the commission xi house representatives advocate for a 30% minimum. The review also includes plans to increase large‑scale IPOs and benchmark against global exchanges, with stakeholder input sought before finalizing the changes.",
        "source": "https://en.antaranews.com/news/382813/idx-will-soon-announce-the-free-float-concept-adjustments",
        "timestamp": "2025-09-26T23:16:00",
        "sector": "financials",
        "sub_sector": [
            "investment-service"
        ],
        "tags": [
            "OJK",
            "Government Policy",
            "Politics & Regulation"
        ],
        "tickers": [],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7870,
        "created_at": "2025-09-27T04:34:37.47169+00:00",
        "title": "Indonesia Targets Final Decision on Freeport Indonesia Share Sale by Early October 2025",
        "body": "Minister Bahlil Lahadalia said the government aims to finalize a non‑dilutive share sale of PT Freeport Indonesia, with the state targeting a 12% stake and Papua Regional‑Owned Enterprise receiving a share, by early October 2025 to extend the mining permit to 2061. The move is intended to secure a 10% minimum state ownership, avoid a decline in peak production after 2035, and maintain revenue and employment levels.",
        "source": "https://en.antaranews.com/news/382809/govt-targets-final-freeport-divestment-value-announcement-in-october",
        "timestamp": "2025-09-26T23:14:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Capital & Funding",
            "Ownership",
            "Government Policy"
        ],
        "tickers": [],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 96
    },
    {
        "id": 7871,
        "created_at": "2025-09-27T04:34:37.47169+00:00",
        "title": "Indonesia Signs MOU to Integrate Industry and Transmigration for Inclusive Growth",
        "body": "The coordinating Ministry of Infrastructure and Regional Development, the Ministry of Transmigration, and the Ministry of Industry signed a memorandum of understanding in Jakarta to transform 154 transmigration zones into industrial‑based regions. The initiative aims to create jobs, enhance human capital, and advance downstream processing under President Prabowo Subianto’s Asta Cita framework.",
        "source": "https://en.antaranews.com/news/382793/govt-pushes-industry-transmigration-synergy-to-drive-inclusive-growth",
        "timestamp": "2025-09-26T22:46:00",
        "sector": "infrastructures",
        "sub_sector": [
            "heavy-constructions-civil-engineering"
        ],
        "tags": [
            "MoU",
            "Ministry",
            "Government Policy"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7877,
        "created_at": "2025-09-27T04:34:38.801343+00:00",
        "title": "Indonesia Replaces State-Owned Enterprises Ministry with New Regulatory Body, Bpbumn, While Retaining Existing SOE Structure",
        "body": "Justice Minister Supratman Andi Agtas announced that Law No. 19/2003 will dissolve the Ministry of State‑Owned Enterprises and replace it with the State‑Owned Enterprises Regulatory Body (Bpbumn), which will act solely as a regulator while Danantara will operate the businesses. The change, approved by all eight factions of Commission VI, aims to strengthen corporate governance and comply with a Constitutional Court ruling, with the new framework to be implemented through a forthcoming presidential regulation.",
        "source": "https://en.antaranews.com/news/382721/state-owned-enterprises-ministry-replaced-by-soe-regulatory-agency",
        "timestamp": "2025-09-26T17:59:00",
        "sector": "financials",
        "sub_sector": [
            "holding-investment-companies"
        ],
        "tags": [
            "Government Policy",
            "Politics & Regulation"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 81
    },
    {
        "id": 7864,
        "created_at": "2025-09-26T04:52:15.032857+00:00",
        "title": "Pefindo maintains a stable rating for PT Provident Investasi Bersama Tbk with a stable outlook, highlighting strong liquidity but noting investment concentration risks",
        "body": "Pefindo confirmed that PT Provident Investasi Bersama Tbk's (Palm) existing bond ratings remain stable, citing a quality investment portfolio, conservative financial policy, strong liquidity supported by a IDR 2.7 trillion dividend from PT Merdeka Copper Gold Tbk, and a repayment plan for the IDR 512.29 billion Sustainable Bond II Series III due on 25 Sept 2025 using internal cash, a revolving credit facility, and MDKA dividend distribution. The rating could be downgraded if cash‑flow protection weakens or investment quality declines, while diversification and higher recurring revenue could lead to an upgrade; major shareholders as of 30 June 2025 include PT Provident Capital Indonesia (58.02%) and Garibaldi Thohir (19.90%).",
        "source": "https://emitennews.com/news/pefindo-angkat-bicara-soal-obligasi-palm-yang-masih-beredar",
        "timestamp": "2025-09-25T00:00:00",
        "sector": "infrastructures",
        "sub_sector": [
            "heavy-constructions-civil-engineering",
            "holding-investment-companies"
        ],
        "tags": [
            "Bonds",
            "Credit",
            "Capital & Funding",
            "Ownership"
        ],
        "tickers": [
            "PALM.JK",
            "PTPP.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7865,
        "created_at": "2025-09-26T04:52:15.032857+00:00",
        "title": "Vanguard Group considers PT Diamond Development Asia Tbk as a strategic entry point, citing Indonesia's upcoming Rp200 trillion stimulus and a potential USD 100 billion valuation",
        "body": "Analysts say Vanguard may use Japanese property partners as proxies to acquire PT Diamond Development Asia Tbk, anticipating that a new government policy will inject Rp200 trillion into the real sector and boost property stocks. The firm is rumored to target a USD 100 billion market cap, equivalent to about Rp230,000 per share, while the stock recently rose 9.55% to Rp149 on 25 September 2025.",
        "source": "https://emitennews.com/news/dada-dilirik-vanguard-sahamnya-disebut-bisa-segini",
        "timestamp": "2025-09-25T00:00:00",
        "sector": "properties-real-estate",
        "sub_sector": [
            "properties-real-estate"
        ],
        "tags": [
            "Mergers & Acquisitions",
            "Government Policy",
            "Foreign Investment",
            "Market Sentiment",
            "Bullish"
        ],
        "tickers": [
            "DADA.JK"
        ],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 1,
            "valuation": 2,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 76
    },
    {
        "id": 7872,
        "created_at": "2025-09-27T04:34:38.129294+00:00",
        "title": "Indonesia Delays Implementation of 0.5% PPH 22 Tax on E-Commerce Marketplaces Until Economic Stimulus Is Fully Implemented",
        "body": "Finance Minister Purbaya Yudhi Sadewa announced that the collection of the 0.5% PPH 22 tax from e-commerce marketplaces will be postponed until the Rp200 trillion stimulus is fully in place, after testing the system for fair implementation. The tax, targeted at merchants with annual revenue above Rp500 million, was originally set by former Minister Sri Mulyani Indrawati and excludes VAT, luxury goods, and certain services.",
        "source": "https://en.antaranews.com/news/382781/govt-delays-pph-22-collection-on-marketplaces-to-sustain-buying-power",
        "timestamp": "2025-09-26T21:44:00",
        "sector": "consumer-cyclicals",
        "sub_sector": [
            "retailing"
        ],
        "tags": [
            "Government Policy",
            "Subsidies & Incentives"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7873,
        "created_at": "2025-09-27T04:34:38.129294+00:00",
        "title": "Indonesia Collects 8.77 Trillion Rupiahs in Digital‑Economy Taxes, Expands VAT Collector Base",
        "body": "Indonesia's Ministry of Finance reports that digital‑economy taxes collected between January and August 2025 totaled 8.77 trillion rupiahs, with value‑added tax from electronic trade accounting for 6.51 trillion, while cryptocurrency, fintech and government procurement sectors contributed 522.82 billion, 952.55 billion and 786.3 billion rupiahs respectively. In August 2025 the tax authority added four new PMSE VAT collectors—blackmagic design asia pte ltd, samsung electronics co ltd, pia private internet access inc and neon commerce inc—while delisting tp global operations limited, and the directorate foresees continued growth as the digital‑economy base expands.",
        "source": "https://en.antaranews.com/news/382777/ri-collects-570-mln-dollars-in-digital-economy-taxes-as-of-august-2025",
        "timestamp": "2025-09-26T21:03:00",
        "sector": "financials",
        "sub_sector": [
            "financing-service"
        ],
        "tags": [
            "Cryptocurrency",
            "Tariff & VAT",
            "Ministry"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7866,
        "created_at": "2025-09-26T04:52:15.740203+00:00",
        "title": "Yopie Tribayu Resigns as Director of PT LCK Global Kedaton Tbk, Effective September 23, 2025",
        "body": "PT LCK Global Kedaton Tbk (LCKM) announced that Yopie Tribayu will step down from his director seat effective September 23, 2025, a move that the company says will not materially affect operations, legal standing, financial condition or business continuity. The company will convene an extraordinary general meeting to discuss the resignation, while the stock fell 3.12% to Rp248 on Thursday.",
        "source": "https://emitennews.com/news/direktur-lckm-mundur-saham-ikut-drop-312-persen",
        "timestamp": "2025-09-25T00:00:00",
        "sector": "infrastructures",
        "sub_sector": [
            "telecommunication"
        ],
        "tags": [
            "Executive Changes",
            "Shareholders General Meeting",
            "Market Sentiment",
            "Bearish"
        ],
        "tickers": [
            "LCKM.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 2,
            "valuation": 2,
            "financials": 0,
            "management": 2,
            "sustainability": 0
        },
        "votes": null,
        "score": 64
    },
    {
        "id": 7874,
        "created_at": "2025-09-27T04:34:38.129294+00:00",
        "title": "Indonesia Warns Consumers Against Buying Illegal Imported Used Clothing Amid Rising Import Flows",
        "body": "The Indonesian government reiterated that thrifting—selling imported used clothing—is illegal and urged the public to refrain from purchasing such goods, citing a 17.33% year‑on‑year increase in imports of finished textiles, used clothing and rags totaling US$78.19 million from January to July 2025. Industry stakeholders, including garment entrepreneur Ellianah Setiady, warned that cheaper illegal imports from countries like China undermine local producers, and the government has amended trade regulations and established a task force to curb these imports.",
        "source": "https://en.antaranews.com/news/382761/indonesia-warns-against-buying-illegal-imported-clothing",
        "timestamp": "2025-09-26T20:38:00",
        "sector": "consumer-cyclicals",
        "sub_sector": [
            "apparel-luxury-goods"
        ],
        "tags": [
            "Import",
            "Government Policy"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 71
    },
    {
        "id": 7875,
        "created_at": "2025-09-27T04:34:38.129294+00:00",
        "title": "Indonesia will not raise tobacco excise tax in 2026, finance minister confirms",
        "body": "Finance Minister Purbaya Yudhi Sadewa announced that Indonesia will keep tobacco excise rates unchanged for 2026 after consulting major domestic cigarette industry players. The government plans to expand tobacco industrial zones to bring informal producers into the formal tax system and support small companies while maintaining industry balance.",
        "source": "https://en.antaranews.com/news/382745/no-hike-in-indonesias-tobacco-excise-tax-next-year-minister",
        "timestamp": "2025-09-26T19:14:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "tobacco"
        ],
        "tags": [
            "Government Policy",
            "Business Expansion"
        ],
        "tickers": [],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7876,
        "created_at": "2025-09-27T04:34:38.129294+00:00",
        "title": "Freeport Indonesia Suspends Grasberg Mine Operations for Three Weeks to Rescue Trapped Miners After Landslide",
        "body": "Freeport Indonesia has halted production at its Grasberg mine for three weeks to focus on rescuing five miners trapped by a landslide, after two workers were found dead and five remain missing. The company’s underground rescue team is using heavy and remote‑controlled equipment to dig through shifting wet material, while the pause has already hurt mining productivity and revenue for the state, region and the company.",
        "source": "https://en.antaranews.com/news/382725/freeport-indonesia-suspends-operations-to-rescue-trapped-miners",
        "timestamp": "2025-09-26T18:06:00",
        "sector": "basic-materials",
        "sub_sector": [
            "basic-materials"
        ],
        "tags": [
            "Production & Operations"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7882,
        "created_at": "2025-09-27T04:34:39.078328+00:00",
        "title": "Bukaka Mega Investama Executes Rp1.33 Trillion Investment in Kerinci Merangin Hidro via BMI Acquisition of 1.2 Million KMH Shares",
        "body": "Bukaka Mega Investama (BMI) has invested Rp1.33 trillion in Kerinci Merangin Hidro (KMH) by acquiring 1.2 million shares at Rp1 million each, representing 22.78% of KMH’s equity based on the interim consolidated financial statements as of March 31, 2025. The investment, part of a phased capital injection up to Rp1.5 trillion, aims to expand BMI’s renewable energy portfolio and enhance shareholder value through increased earnings and dividends.",
        "source": "https://emitennews.com/news/bukaka-bukk-eksekusi-transaksi-rp133-t-simak-detailnya",
        "timestamp": "2025-09-27T00:00:00",
        "sector": "infrastructures",
        "sub_sector": [
            "heavy-constructions-civil-engineering"
        ],
        "tags": [
            "Capital & Funding",
            "Business Expansion",
            "Ownership"
        ],
        "tickers": [
            "BUKK.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7883,
        "created_at": "2025-09-27T04:34:39.078328+00:00",
        "title": "Commissioner Noel Aelyo Laras Kusuma Negara Reduces Shareholding in PT Dharma Polimetal Tbk Through Multiple Sales in September 2025",
        "body": "Noel Aelyo Laras Kusuma Negara, a commissioner of PT Dharma Polimetal Tbk, sold 200,000 shares in total during September 2025—100,000 shares on 23 September at Rp985–Rp990 each and another 100,000 shares on 19 and 22 September at Rp985 and Rp995 each—reducing his stake from 70.3 million shares (1.494%) to 70.2 million shares (1.492%).",
        "source": "https://emitennews.com/news/kurangi-porsi-komisaris-ini-jual-saham-dharma-polimetal-drma",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "consumer-cyclicals",
        "sub_sector": [
            "automobiles-components"
        ],
        "tags": [
            "Ownership"
        ],
        "tickers": [
            "DRMA.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7884,
        "created_at": "2025-09-27T04:34:39.078328+00:00",
        "title": "Inet Announces Rights Issue of Up to Rp3.2 Trillion to Fund Fiber Expansion, with Controlling Shareholder Committing to Full Participation",
        "body": "Inet will issue up to 12.8 billion new shares at Rp250 each (rights ratio 3:4), raising a maximum of Rp3.2 trillion and potentially diluting non‑participating shareholders by up to 57.14 %. Controlling shareholder PT Abadi Kreasi Unggul Nusantara has pledged to exercise all rights and act as a standby buyer for any remaining shares, while the proceeds will fund high‑speed fiber expansion, a Rp2.8 trillion allocation to GPI for 2 million new customers in Bali and Lombok, and other operational costs, with an additional Rp921.6 billion potential from a series II warrant issuance.",
        "source": "https://emitennews.com/news/pengendali-jadi-standby-buyer-inet-akan-right-issue-rp32-triliun",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "consumer-cyclicals",
        "sub_sector": [
            "household-goods"
        ],
        "tags": [
            "Rights Issue",
            "Capital & Funding",
            "Business Expansion"
        ],
        "tickers": [
            "WOOD.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 91
    },
    {
        "id": 7885,
        "created_at": "2025-09-27T04:34:39.078328+00:00",
        "title": "PT Merdeka Gold Resources Tbk. Targets Commercial Production of the Pani Gold Project in Q1 2026",
        "body": "The Pani project, owned by emas under PT Merdeka Copper Gold Tbk., has reached 67% completion as of June 2025 and is slated to begin commercial production in Q1 2026, with an expected 130,000 oz output at 90% capacity and a projected revenue of US$533 million for 2026. Cash costs are projected to decline to US$950/oz, contributing significantly to mdka’s gold‑segment earnings.",
        "source": "https://emitennews.com/news/tambang-emas-pani-milik-emas-diramal-bakal-jadi-raksasa-asia-pasifik",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "infrastructures",
        "sub_sector": [
            "heavy-constructions-civil-engineering"
        ],
        "tags": [
            "Production & Operations",
            "Financial Metrics"
        ],
        "tickers": [
            "PTPP.JK"
        ],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7891,
        "created_at": "2025-09-27T04:34:39.351279+00:00",
        "title": "PT Batavia Prosperindo Internasional Tbk to Hold Shareholders Meeting on October 20, 2025 to Approve Treasury Stock Reduction",
        "body": "The corporate secretary Kamal stated that a key agenda for the upcoming general meeting is to seek shareholder approval for a plan to transfer treasury shares back into the market through a capital reduction mechanism, aimed at strengthening the company’s capital structure and supporting its long‑term business strategy. The meeting will also discuss amendments to the company’s articles of association related to this capital reduction.",
        "source": "https://emitennews.com/news/batavia-prosperindo-bpii-minta-restu-lepas-saham-treasuri",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "financials",
        "sub_sector": [
            "holding-investment-companies"
        ],
        "tags": [
            "Capital & Funding",
            "Shareholders General Meeting"
        ],
        "tickers": [
            "BPII.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7892,
        "created_at": "2025-09-27T04:34:39.97911+00:00",
        "title": "Jhon Veter Firdaus expands stake in PT Fuji Finance Indonesia Tbk with Rp4.99 billion share purchase",
        "body": "Jhon Veter Firdaus, a shareholder holding over 5% of PT Fuji Finance Indonesia Tbk, bought an additional 6.32 million shares at Rp790 each on Wednesday, valuing the transaction at about Rp4.99 billion and raising his total holding to 165.32 million shares. The purchase follows earlier September acquisitions totaling roughly Rp10 billion, while Fuji's share price closed at Rp760, up 75.9% over the past month and 123.5% over six months; Firdaus also holds a 5.01% stake in PT Brigit Biofarmaka Teknologi Tbk.",
        "source": "https://emitennews.com/news/investor-tajir-asal-klaten-borong-lagi-saham-fuji-rp499m",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "healthcare",
        "sub_sector": [
            "pharmaceuticals-health-care-research",
            "financing-service"
        ],
        "tags": [
            "Ownership",
            "Market Sentiment",
            "Bullish"
        ],
        "tickers": [
            "OBAT.JK",
            "FUJI.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 2,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 96
    },
    {
        "id": 7893,
        "created_at": "2025-09-27T04:34:39.97911+00:00",
        "title": "Bank Indonesia’s 2025 rate cut to 4.75% expected to boost PT Asuransi Tugu Pratama Indonesia Tbk’s bond‑heavy investment portfolio",
        "body": "Bank Indonesia lowered the BI rate by 25 basis points to 4.75%, marking its fifth cut in 2025, which analysts say will raise bond prices and benefit insurers with large fixed‑income holdings. PT Asuransi Tugu Pratama Indonesia Tbk reported a 22.9% YoY rise in total investment income to Rp316.7 billion, with bond earnings contributing Rp219.4 billion (69.3% of the total).",
        "source": "https://emitennews.com/news/kinerja-investasi-tugu-berpotensi-melonjak-ini-pemicunya",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "financials",
        "sub_sector": [
            "banks",
            "insurance"
        ],
        "tags": [
            "Central Bank",
            "Interest Rate",
            "Bonds"
        ],
        "tickers": [
            "MCOR.JK",
            "TUGU.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 2,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7894,
        "created_at": "2025-09-27T04:34:39.97911+00:00",
        "title": "PT Wismilak Inti Makmur Tbk to Offer 24.1 Million Treasury Shares on IDX from Oct 2025 to Oct 2026",
        "body": "The company will sell its remaining 24,100,400 treasury shares on the Indonesia Stock Exchange between 6 Oct 2025 and 5 Oct 2026. This follows a 2022 buy‑back of 27.9 million shares and a partial resale of 3,799,600 shares in late 2023, leaving the current treasury balance for the upcoming offering.",
        "source": "https://emitennews.com/news/wismilak-wiim-ungkap-rencana-aksi-baru",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "tobacco"
        ],
        "tags": [
            "Stock Buyback",
            "Capital & Funding"
        ],
        "tickers": [
            "WIIM.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 1,
            "technical": 0,
            "valuation": 0,
            "financials": 1,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 64
    },
    {
        "id": 7895,
        "created_at": "2025-09-27T04:34:39.97911+00:00",
        "title": "Indonesia Stock Exchange Resumes Trading of PT Koka Indonesia Tbk After Suspension Over Controlling Shareholder Breach",
        "body": "BEI lifted the suspension of PT Koka Indonesia Tbk’s shares on 26 September 2025, with the stock trading flat at Rp184 after a period of strong gains (84% month‑on‑month, 124.6% six‑month, 183% YTD). The company clarified that the proposed acquisition of a 63.5% stake by Ningbo Lixing Enterprise Management Co., Ltd remains a non‑binding plan pending regulatory approval and does not yet constitute a change of control.",
        "source": "https://emitennews.com/news/bei-akhirnya-lepas-gembok-saham-koka-ini-alasannya",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "infrastructures",
        "sub_sector": [
            "heavy-constructions-civil-engineering"
        ],
        "tags": [
            "Suspension",
            "Mergers & Acquisitions",
            "Ownership",
            "Foreign Investment",
            "Neutral"
        ],
        "tickers": [
            "KOKA.JK"
        ],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 1,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7896,
        "created_at": "2025-09-27T04:34:39.97911+00:00",
        "title": "PT Pakai Donk Nusantara launches QRIS acquirer service in partnership with PT Rintis Sejahtera and PT Penyelesaian Transaksi Elektronik Nasional",
        "body": "The Jakarta launch announced that PT Pakai Donk Nusantara, a Category 1 payment service provider licensed by Bank Indonesia, has received official QRIS acquirer approval and will offer merchants faster settlement, broad integration and security. The service, developed with PT Rintis Sejahtera and PT Penyelesaian Transaksi Elektronik Nasional, aims to expand digital payment inclusion for UMKM and the wider Indonesian market.",
        "source": "https://emitennews.com/news/pakai-donk-nusantara-resmi-luncurkan-qris-acquirer-bareng-pten",
        "timestamp": "2025-09-26T00:00:00",
        "sector": "financials",
        "sub_sector": [
            "financing-service"
        ],
        "tags": [
            "Digital Payments",
            "Digital Transformation",
            "Central Bank",
            "Business Expansion"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7897,
        "created_at": "2025-09-28T03:59:51.584515+00:00",
        "title": "Deputy Agriculture Minister Urges Regions to Finish Irrigation Projects Amid Rp12 Trillion Central Funding",
        "body": "Deputy Agriculture Minister Sudaryono urged provincial and district leaders not to divert irrigation budgets and to accelerate completion of irrigation projects, citing President Prabowo Subianto’s new policy that consolidates authority across all government levels and the allocation of Rp12 trillion to resolve nationwide irrigation issues. He highlighted that 80,000 irrigation points are slated for improvement next year and stressed the need for joint efforts to ensure water flow and food security.",
        "source": "https://en.antaranews.com/news/382941/deputy-agriculture-minister-urges-regions-to-complete-irrigation",
        "timestamp": "2025-09-27T18:27:00",
        "sector": "infrastructures",
        "sub_sector": [
            "utilities"
        ],
        "tags": [
            "Government Policy",
            "Politics & Regulation"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 2
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7898,
        "created_at": "2025-09-28T03:59:51.584515+00:00",
        "title": "BGN to Ban Factory-Made Foods in Free Meal Program, Shift to Local Suppliers Amid Food Poisoning Concerns",
        "body": "BGN announced it will stop sourcing manufactured food from conglomerate-owned factories for its free meal program, instead relying on local micro, small, and medium enterprises and allowing packaged milk only when no local dairy farms are available. The agency warned MBG kitchen operators not to serve factory-made products, citing recent food‑poisoning incidents linked to MBG packages and a case where chicken was stored for days before being served.",
        "source": "https://en.antaranews.com/news/382909/ri-govt-to-bar-factory-food-in-free-meal-program-back-msmes",
        "timestamp": "2025-09-27T15:53:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-staples-retailing"
        ],
        "tags": [
            "Government Policy",
            "Risk & Compliance"
        ],
        "tickers": [],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    },
    {
        "id": 7899,
        "created_at": "2025-09-28T03:59:51.584515+00:00",
        "title": "Indonesia Parliament Approves Freeze on Tobacco Excise Tariffs for 2026",
        "body": "Indonesia’s parliament backed Finance Minister Purbaya Yudhi Sadewa’s decision not to raise tobacco excise tariffs in 2026, citing industry pressures, job risks and state revenue concerns. Commission XI chairman Mukhamad Misbakhun urged a comprehensive review of the tobacco tariff framework to curb illegal trade, sustain revenue and protect livelihoods in the sector.",
        "source": "https://en.antaranews.com/news/382889/indonesias-parliament-backs-freeze-on-tobacco-excise-in-2026",
        "timestamp": "2025-09-27T15:00:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "tobacco"
        ],
        "tags": [
            "Tariff & VAT",
            "Government Policy",
            "Politics & Regulation"
        ],
        "tickers": [],
        "dimension": {
            "future": 1,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7900,
        "created_at": "2025-09-28T03:59:51.584515+00:00",
        "title": "PT Bank Rakyat Indonesia TBK Achieves 99.1% Digital Transaction Share, Expands Digital Ecosystem with Brimo and AgentBrilink",
        "body": "PT Bank Rakyat Indonesia TBK (Bri) reports that digital banking accounts for 99.1% of its total transactions, with 702,000 e‑channel units including 10,650 ATMs, 9,007 CRM units, and 682,370 merchants. By August 2025, Brimo users grew 20.35% YoY to 43.9 million, while AgentBrilink reached over 1 million agents in 66,691 villages, processing Rp1.14522 trillion in 734 million transactions.",
        "source": "https://emitennews.com/news/bri-catat-991-transaksi-digital-nasabah-kian-melek-teknologi",
        "timestamp": "2025-09-28T00:00:00",
        "sector": "healthcare",
        "sub_sector": [
            "pharmaceuticals-health-care-research",
            "banks"
        ],
        "tags": [
            "Digital Payments",
            "Digital Transformation"
        ],
        "tickers": [
            "OBAT.JK",
            "BBRI.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7901,
        "created_at": "2025-09-28T03:59:51.584515+00:00",
        "title": "Waskita Karya Advances Jakarta-Cikampek South Toll Road to 90% Completion, Targeting Mid-2026 Finish",
        "body": "Waskita Karya reports that the 31.25‑km Jakarta‑Cikampek South toll segment is 90.11% complete as of September 2025, with the full 62‑km project expected to finish by mid‑2026. The company highlights BIM technology, reduced travel time from Jakarta to Bandung to 45 minutes, and potential economic benefits such as job creation and tourism access.",
        "source": "https://emitennews.com/news/capai-9011-persen-wskt-akselerasi-tol-japek-ii-selatan",
        "timestamp": "2025-09-27T00:00:00",
        "sector": "infrastructures",
        "sub_sector": [
            "heavy-constructions-civil-engineering"
        ],
        "tags": [
            "Digital Transformation",
            "Production & Operations",
            "Business Expansion"
        ],
        "tickers": [
            "WSKT.JK"
        ],
        "dimension": {
            "future": 2,
            "dividend": 0,
            "ownership": 0,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7902,
        "created_at": "2025-09-28T03:59:52.239296+00:00",
        "title": "Kalbe Farma Divests 5.5 Million Shares of Enseval Putera Megatrading at Rp2,400 Each, Reducing Ownership to 91.98%",
        "body": "Kalbe Farma sold 5.5 million shares of Enseval Putera Megatrading at Rp2,400 per share, a price 80 points (3.44%) above the September 25, 2025 closing of Rp2,320. The divestiture lowered Kalbe's stake to 2.491 billion shares (91.98%) and caused a 0.2% dilution, with no material impact on the company’s operations or financial condition.",
        "source": "https://emitennews.com/news/pengendali-epmt-lego-jutaan-lembar-ini-tujuannya",
        "timestamp": "2025-09-27T00:00:00",
        "sector": "consumer-non-cyclicals",
        "sub_sector": [
            "food-staples-retailing",
            "pharmaceuticals-health-care-research"
        ],
        "tags": [
            "Ownership",
            "Financial Metrics"
        ],
        "tickers": [
            "EPMT.JK",
            "KLBF.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 0,
            "technical": 2,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 61
    },
    {
        "id": 7903,
        "created_at": "2025-09-28T03:59:52.239296+00:00",
        "title": "Prajogo Pangestu Sells 84.64 Million Shares of Barito Renewables Energy at Rp8.247 Each, Raising Rp698.03 Billion",
        "body": "Prajogo Pangestu sold 84.64 million shares of Barito Renewables Energy through Green Energy Pte Ltd on 24 September 2025 at Rp8.247 per share, a 7.59% discount to the 22 September closing price of Rp8.925, generating Rp698.03 billion. After the sale, Nancy Pangestu remains the largest shareholder with 29.32 million shares (21.92%), and the divestment is part of a strategy to increase the company’s free float, following a prior sale of 163.83 million shares between 11 August and 15 September 2025.",
        "source": "https://emitennews.com/news/lego-8464-juta-saham-bren-green-energy-raup-rp698-miliar",
        "timestamp": "2025-09-27T00:00:00",
        "sector": "infrastructures",
        "sub_sector": [
            "utilities"
        ],
        "tags": [
            "Ownership"
        ],
        "tickers": [
            "BREN.JK"
        ],
        "dimension": {
            "future": 0,
            "dividend": 0,
            "ownership": 1,
            "technical": 0,
            "valuation": 0,
            "financials": 0,
            "management": 0,
            "sustainability": 0
        },
        "votes": null,
        "score": 66
    }
    
]