{"insurance": "The Insurance sector provides financial protection for individuals and businesses through policies like health, life, vehicle, and property insurance. The industry is regulated by the Financial Services Authority (OJK) and supported by organizations like AAUI (Indonesian General Insurance Association) and AAJI (Indonesian Life Insurance Association) to ensure compliance and industry growth. Currently, this sub-sector appears to be on an upward trend, with a notable total market capitalization growth of approximately 40.65% over the last 365 days. However, a closer look at individual companies reveals that a larger number are showing negative changes (10) in market capitalization compared to those with positive changes (8). This indicates that the larger companies with positive changes are exerting a significant influence on the overall market capitalization, despite more companies experiencing declines. Notable companies in this subsector, based on market capitalization, include [#LIFE.JK]PT MSIG Life Insurance Indonesia Tbk[\\#LIFE.JK], [#PNLF.JK]Panin Financial Tbk[\\#PNLF.JK], [#BHAT.JK]PT Bhakti Multi Artha Tbk[\\#BHAT.JK], [#PNIN.JK]Paninvest Tbk[\\#PNIN.JK], and [#TUGU.JK]PT Asuransi Tugu Pratama Indonesia Tbk[\\#TUGU.JK].", "nondurable-household-products": "The Nondurable Household Products sector focuses on consumable items such as cleaning supplies, toiletries, paper products, and other fast-moving consumer goods that are regularly purchased and used in homes. The industry is regulated by the **Ministry of Industry** and supported by organizations like the **Indonesian Household and Personal Care Association (HIPMI)** to ensure quality standards and product safety. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -24.47% over the past 365 days. It's possible that around 7 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 4 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#KPAS.JK]PT Cottonindo Ariesta Tbk[\\#KPAS.JK], [#UNVR.JK]Unilever Indonesia Tbk[\\#UNVR.JK], [#VICI.JK]PT Victoria Care Indonesia Tbk[\\#VICI.JK], [#UCID.JK]PT Uni-Charm Indonesia Tbk[\\#UCID.JK], and [#MSJA.JK]PT Multi Spunindo Jaya Tbk[\\#MSJA.JK].", "basic-materials": "The Basic Materials sector covers the extraction, processing, and distribution of raw materials like minerals, metals, chemicals, and construction materials. The industry is regulated by the Ministry of Industry and the Ministry of Energy and Mineral Resources (ESDM), with support from organizations like the Indonesian Mining Association (IMA) the Indonesian Iron & Steel Industry Association (IISIA) and the Indonesian Cement Association (ASI). Currently, this sub-sector appears to be amidst a bearish trend, marked by an overall market capitalization depreciation of approximately -6.44% over the past 365 days. However, upon closer examination of individual companies, it's evident that more companies are undergoing positive changes (65) in market capitalization compared to those experiencing negative changes (37). This suggests that larger companies with negative changes are exerting significant influence despite more companies having upward trends. Notable companies in this subsector, based on market capitalization, include [#JKSW.JK]Jakarta Kyoei Steel Works Tbk[\\#JKSW.JK], [#TPIA.JK]PT Chandra Asri Pacific Tbk[\\#TPIA.JK], [#AMMN.JK]PT Amman Mineral Internasional Tbk[\\#AMMN.JK], [#BRPT.JK]Barito Pacific Tbk[\\#BRPT.JK], and [#ANTM.JK]Aneka Tambang Tbk[\\#ANTM.JK].", "household-goods": "The Household Goods sector produces and distributes essential products used in daily life, including furniture, home appliances, kitchenware, and decorative items. The industry is regulated by the Ministry of Industry and supported by organizations such as the Indonesian Furniture Association (ASMINDO) and the Indonesian Household Appliances Association (HIPMI), ensuring quality standards and industry development. At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 43.94% over the past 365 days. It appears that 10 companies in this sub-sector might have seen a positive market cap change, while around 3 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#WOOD.JK]PT Integra Indocabinet Tbk[\\#WOOD.JK], [#MGLV.JK]PT Panca Anugrah Wisesa Tbk[\\#MGLV.JK], [#LIVE.JK]PT Homeco Victoria Makmur Tbk[\\#LIVE.JK], [#SCNP.JK]PT Selaras Citra Nusantara Perkasa Tbk[\\#SCNP.JK], and [#LFLO.JK]PT Imago Mulia Persada Tbk[\\#LFLO.JK].", "transportation": "The Transportation sector includes public and private services that facilitate the movement of passengers and goods. It covers land, sea, and air transport, including buses, trains, airlines, and shipping services, ensuring connectivity across Indonesia's islands. The industry is regulated by the Ministry of Transportation and supported by organizations such as the Indonesian National Air Carrier Association (INACA), the Indonesian Shipping Association (INSA), and the Indonesian Bus Association (APTSI). Currently, this sub-sector appears to be amidst a bearish trend, marked by an overall market capitalization depreciation of approximately -18.23% over the past 365 days. However, upon closer examination of individual companies, it's evident that more companies are undergoing positive changes (8) in market capitalization compared to those experiencing negative changes (4). This suggests that larger companies with negative changes are exerting significant influence despite more companies having upward trends. Notable companies in this subsector, based on market capitalization, include [#BIRD.JK]PT Blue Bird Tbk[\\#BIRD.JK], [#ASSA.JK]Adi Sarana Armada Tbk[\\#ASSA.JK], [#IMJS.JK]PT Indomobil Multi Jasa Tbk[\\#IMJS.JK], [#GIAA.JK]Garuda Indonesia (Persero) Tbk[\\#GIAA.JK], and [#CMPP.JK]PT AirAsia Indonesia Tbk[\\#CMPP.JK].", "properties-real-estate": "The Properties & Real Estate sector is responsible for the development, management, and sale of residential, commercial, and industrial properties. It includes housing projects, office buildings, retail spaces, and industrial zones, contributing to urban expansion and economic activities. The industry is regulated by the Ministry of Public Works and Housing (Kementrian PUPR) and supported by organizations like the Indonesian Real Estate Association (REI) to ensure growth and industry standards. At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 22.91% over the past 365 days. It appears that 60 companies in this sub-sector might have seen a positive market cap change, while around 21 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#FORZ.JK]PT Forza Land Indonesia Tbk[\\#FORZ.JK], [#MYRX.JK]Hanson International Tbk[\\#MYRX.JK], [#MPRO.JK]PT Maha Properti Indonesia Tbk[\\#MPRO.JK], [#CBDK.JK]PT Bangun Kosambi Sukses Tbk[\\#CBDK.JK], and [#MKPI.JK]Metropolitan Kentjana Tbk[\\#MKPI.JK].", "food-staples-retailing": "The Food & Staples Retailing sector includes supermarkets, minimarkets, traditional markets, and online grocery platforms that distribute essential food items and daily necessities. It connects producers with consumers, ensuring food accessibility and affordability. The industry is regulated by the Ministry of Trade and supported by organizations like the Indonesian Retailers Association (APRINDO) to maintain standards and support growth. Currently, this sub-sector appears to be amidst a bearish trend, marked by an overall market capitalization depreciation of approximately -18.62% over the past 365 days. However, upon closer examination of individual companies, it's evident that more companies are undergoing positive changes (7) in market capitalization compared to those experiencing negative changes (6). This suggests that larger companies with negative changes are exerting significant influence despite more companies having upward trends. Notable companies in this subsector, based on market capitalization, include [#AMRT.JK]PT Sumber Alfaria Trijaya Tbk[\\#AMRT.JK], [#MIDI.JK]Midi Utama Indonesia Tbk[\\#MIDI.JK], [#EPMT.JK]Enseval Putera Megatrading Tbk[\\#EPMT.JK], [#DMND.JK]PT Diamond Food Indonesia Tbk[\\#DMND.JK], and [#DAYA.JK]PT Duta Intidaya Tbk[\\#DAYA.JK].", "logistics-deliveries": "The Logistics & Deliveries sector drives the movement of goods across Indonesia’s archipelago, supporting retail, manufacturing, and e-commerce. This industry is regulated by the Ministry of Transportation (Kementrian Perhubungan) and supported by organizations like Indonesian Logistics and Forwarders Association and Indonesia National Single Window. At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 1.05% over the past 365 days. It appears that 18 companies in this sub-sector might have seen a positive market cap change, while around 5 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#TMAS.JK]PT Temas Tbk[\\#TMAS.JK], [#SMDR.JK]Samudera Indonesia Tbk[\\#SMDR.JK], [#ELPI.JK]PT Pelayaran Nasional Ekalya Purnamasari Tbk[\\#ELPI.JK], [#HATM.JK]PT Habco Trans Maritima Tbk[\\#HATM.JK], and [#BLOG.JK]PT Trimitra Trans Persada Tbk[\\#BLOG.JK].", "financing-service": "The Financing Service sector in Indonesia includes non-bank financial institutions, fintech companies, and microfinance providers. This sector plays a critical role in increasing financial inclusion and providing accessible financing options to underserved markets. Regulated by the Financial Services Authority (OJK - Otoritas Jasa Keuangan), the sector ensures consumer protection, transparency, and financial stability. Key industry players like OJK’s Fintech Division and the Indonesian Association of Microfinance Institutions (APIMI) are crucial in supporting innovation and growth in the sector. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -19.88% over the past 365 days. It's possible that around 9 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 5 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#FINN.JK]PT First Indo American Leasing Tbk[\\#FINN.JK], [#BFIN.JK]BFI Finance Indonesia Tbk[\\#BFIN.JK], [#ADMF.JK]Adira Dinamika Multi Finance Tbk[\\#ADMF.JK], [#MFIN.JK]PT Mandala Multifinance Tbk[\\#MFIN.JK], and [#BBLD.JK]Buana Finance Tbk[\\#BBLD.JK].", "investment-service": "The Investment Service sector provides financial management, securities trading, wealth advisory, and capital allocation services. It facilitates investment opportunities for individuals and businesses seeking to grow their financial assets. The industry is regulated by the Financial Services Authority (OJK) and supported by organizations such as the Indonesia Stock Exchange (IDX) and the Indonesian Investment Managers Association (APRDI). At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 17.19% over the past 365 days. It appears that 4 companies in this sub-sector might have seen a positive market cap change, while around 2 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#YULE.JK]Yulie Sekuritas Indonesia Tbk[\\#YULE.JK], [#TRIM.JK]PT Trimegah Sekuritas Indonesia Tbk[\\#TRIM.JK], [#RELI.JK]Reliance Sekuritas Indonesia Tbk[\\#RELI.JK], [#AMOR.JK]PT Ashmore Asset Management Indonesia Tbk[\\#AMOR.JK], and [#PANS.JK]Panin Sekuritas Tbk[\\#PANS.JK].", "healthcare-equipment-providers": "The Healthcare Equipment & Providers sector includes hospitals, medical clinics, diagnostic centers, and suppliers of medical devices and equipment. It supports healthcare services by providing essential infrastructure, medical treatments, and patient care. The industry is regulated by the Ministry of Health and supported by organizations such as the Indonesian Hospital Association (PERSI) and the Indonesian Medical Device Producers Association (ASPAKI). At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 35.39% over the past 365 days. It appears that 13 companies in this sub-sector might have seen a positive market cap change, while around 8 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#SRAJ.JK]Sejahteraraya Anugrahjaya Tbk[\\#SRAJ.JK], [#MIKA.JK]PT Mitra Keluarga Karyasehat Tbk[\\#MIKA.JK], [#SILO.JK]PT Siloam International Hospitals Tbk[\\#SILO.JK], [#HEAL.JK]PT Medikaloka Hermina Tbk[\\#HEAL.JK], and [#PRAY.JK]PT Famon Awal Bros Sedaya Tbk[\\#PRAY.JK].", "consumer-services": "The Consumer Services sector includes businesses that provide services directly to consumers, such as hospitality, tourism, education, and personal care. It enhances the quality of life by offering recreational, wellness, and lifestyle services. At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 5.94% over the past 365 days. It appears that 28 companies in this sub-sector might have seen a positive market cap change, while around 18 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#MAMI.JK]Mas Murni Indonesia Tbk[\\#MAMI.JK], [#KPIG.JK]MNC Tourism Indonesia Tbk[\\#KPIG.JK], [#CNMA.JK]PT Nusantara Sejahtera Raya Tbk[\\#CNMA.JK], [#JSPT.JK]Jakarta Setiabudi Internasional Tbk[\\#JSPT.JK], and [#BUVA.JK]PT Bukit Uluwatu Villa Tbk[\\#BUVA.JK].", "technology-hardware-equipment": "The Technology Hardware & Equipment sector manufactures and supplies electronic devices, computer hardware, communication equipment, and industrial technology components. The industry is regulated by the Ministry of Industry and supported by organizations such as the Indonesian Electronics Producers Association (GABEL) and the Indonesian Telecommunication Society (MASTEL). At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 7.97% over the past 365 days. It appears that 6 companies in this sub-sector might have seen a positive market cap change, while around 5 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#MTDL.JK]Metrodata Electronics Tbk[\\#MTDL.JK], [#MSTI.JK]PT Mastersystem Infotama Tbk[\\#MSTI.JK], [#PTSN.JK]Sat Nusapersada Tbk[\\#PTSN.JK], [#CHIP.JK]PT Pelita Teknologi Global Tbk[\\#CHIP.JK], and [#AXIO.JK]PT Tera Data Indonusa Tbk[\\#AXIO.JK].", "retailing": "The Retailing sector consists of businesses selling a variety of consumer products, including clothing, electronics, household goods, and personal items, through physical stores, department stores, and e-commerce platforms. The industry is regulated by the Ministry of Trade and supported by organizations such as the Indonesian Retailers Association (APRINDO) and the Indonesian E-Commerce Association (idEA). Currently, this sub-sector appears to be on an upward trend, with a notable total market capitalization growth of approximately 11.33% over the last 365 days. However, a closer look at individual companies reveals that a larger number are showing negative changes (15) in market capitalization compared to those with positive changes (13). This indicates that the larger companies with positive changes are exerting a significant influence on the overall market capitalization, despite more companies experiencing declines. Notable companies in this subsector, based on market capitalization, include [#TURI.JK]Tunas Ridean Tbk[\\#TURI.JK], [#MDIY.JK]PT Daya Intiguna Yasa Tbk[\\#MDIY.JK], [#MAPI.JK]Mitra Adiperkasa Tbk[\\#MAPI.JK], [#MAPA.JK]PT MAP Aktif Adiperkasa Tbk[\\#MAPA.JK], and [#TRIO.JK]Trikomsel Oke Tbk[\\#TRIO.JK].", "utilities": "The Utilities sector provides essential services like electricity, water, and natural gas to households, businesses, and industries. It ensures energy availability, water management, and sustainable infrastructure development and is regulated by the Ministry of Energy and Mineral Resources (ESDM). Currently, this sub-sector appears to be amidst a bearish trend, marked by an overall market capitalization depreciation of approximately -1.98% over the past 365 days. However, upon closer examination of individual companies, it's evident that more companies are undergoing positive changes (8) in market capitalization compared to those experiencing negative changes (1). This suggests that larger companies with negative changes are exerting significant influence despite more companies having upward trends. Notable companies in this subsector, based on market capitalization, include [#BREN.JK]PT Barito Renewables Energy Tbk[\\#BREN.JK], [#CDIA.JK]PT Chandra Daya Investasi Tbk[\\#CDIA.JK], [#PGEO.JK]PT Pertamina Geothermal Energy Tbk[\\#PGEO.JK], [#POWR.JK]PT Cikarang Listrindo Tbk[\\#POWR.JK], and [#ARKO.JK]PT Arkora Hydro Tbk[\\#ARKO.JK].", "transportation-infrastructure": "The Transportation Infrastructure sector involves the development, maintenance, and operation of transport facilities like highways, railways, seaports, and airports. Key infrastructure projects in Indonesia include the Trans-Java Toll Road, Soekarno-Hatta International Airport in Jakarta, and major seaports such as Tanjung Priok, all crucial for ensuring efficient movement of people and goods, supporting national connectivity Currently, this sub-sector appears to be amidst a bearish trend, marked by an overall market capitalization depreciation of approximately -20.46% over the past 365 days. However, upon closer examination of individual companies, it's evident that more companies are undergoing positive changes (5) in market capitalization compared to those experiencing negative changes (3). This suggests that larger companies with negative changes are exerting significant influence despite more companies having upward trends. Notable companies in this subsector, based on market capitalization, include [#JSMR.JK]PT Jasa Marga Tbk[\\#JSMR.JK], [#CMNP.JK]Citra Marga Nusaphala Persada Tbk[\\#CMNP.JK], [#CASS.JK]PT Cahaya Aero Services Tbk[\\#CASS.JK], [#META.JK]Nusantara Infrastructure Tbk[\\#META.JK], and [#PORT.JK]PT Nusantara Pelabuhan Handal Tbk[\\#PORT.JK].", "apparel-luxury-goods": "The Apparel & Luxury Goods sector encompasses the production, marketing, and sale of clothing, footwear, accessories, and high-end fashion products. In Indonesia, this sector is represented by premium outlets and luxury shopping destinations such as Plaza Indonesia, Pacific Place, and Jakarta Premium Outlets in Jakarta, as well as high-end shopping malls like Bali Collection in Bali, which feature top global luxury brands. At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 21.38% over the past 365 days. It appears that 13 companies in this sub-sector might have seen a positive market cap change, while around 8 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#HDTX.JK]Panasia Indo Resources Tbk[\\#HDTX.JK], [#POLU.JK]PT Golden Flower Tbk[\\#POLU.JK], [#ARGO.JK]Argo Pantes Tbk[\\#ARGO.JK], [#HRTA.JK]PT Hartadinata Abadi Tbk[\\#HRTA.JK], and [#SRIL.JK]PT Sri Rejeki Isman Tbk[\\#SRIL.JK].", "tobacco": "The Tobacco sector involves the cultivation, manufacturing, and distribution of tobacco products, including cigarettes and cigars. It is a significant part of Indonesia's economy, with widespread domestic production and export activities. The industry is regulated by the Ministry of Industry and the Ministry of Agriculture, with support from organizations such as the Indonesian Tobacco Growers Association (APTI) and the Indonesian Cigarette Manufacturers Association (GAPPRI). At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -31.44% over the past 365 days. It's possible that around 4 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 0 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#RMBA.JK]Bentoel International Investama Tbk[\\#RMBA.JK], [#HMSP.JK]HM Sampoerna Tbk[\\#HMSP.JK], [#GGRM.JK]Gudang Garam Tbk[\\#GGRM.JK], [#WIIM.JK]Wismilak Inti Makmur Tbk[\\#WIIM.JK], and [#ITIC.JK]PT Indonesian Tobacco Tbk[\\#ITIC.JK].", "heavy-constructions-civil-engineering": "The Heavy Construction & Civil Engineering sector focuses on the planning, development, and execution of large-scale infrastructure projects such as roads, bridges, airports, and public facilities. The industry is regulated by the Ministry of Public Works and Housing (PUPR) and supported by organizations such as the Indonesian Contractors Association (AKI) and the Indonesian Association of Construction Companies (GAPENSI). At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 2.88% over the past 365 days. It appears that 19 companies in this sub-sector might have seen a positive market cap change, while around 6 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#SSIA.JK]PT Surya Semesta Internusa Tbk[\\#SSIA.JK], [#WIKA.JK]PT Wijaya Karya (Persero) Tbk[\\#WIKA.JK], [#WSKT.JK]PT Waskita Karya (Persero) Tbk[\\#WSKT.JK], [#RONY.JK]PT Aracord Nusantara Group Tbk[\\#RONY.JK], and [#TOTL.JK]Total Bangun Persada Tbk[\\#TOTL.JK].", "media-entertainment": "The Media & Entertainment sector encompasses television, radio, print media, film, music, and digital content production. In Indonesia, this sector is regulated by the Ministry of Communication and Informatics (Kementerian Komunikasi dan Informatika), which oversees media licensing, broadcasting standards, and digital content management. Currently, this sub-sector appears to be amidst a bearish trend, marked by an overall market capitalization depreciation of approximately -35.45% over the past 365 days. However, upon closer examination of individual companies, it's evident that more companies are undergoing positive changes (11) in market capitalization compared to those experiencing negative changes (7). This suggests that larger companies with negative changes are exerting significant influence despite more companies having upward trends. Notable companies in this subsector, based on market capitalization, include [#FILM.JK]PT MD Entertainment Tbk[\\#FILM.JK], [#MSIN.JK]PT MNC Digital Entertainment Tbk[\\#MSIN.JK], [#SCMA.JK]Surya Citra Media Tbk[\\#SCMA.JK], [#NETV.JK]PT MDTV Media Technologies Tbk[\\#NETV.JK], and [#MNCN.JK]Media Nusantara Citra Tbk[\\#MNCN.JK].", "telecommunication": "The Telecommunication sector provides mobile, internet, and broadband services, ensuring digital connectivity for individuals and businesses across Indonesia. It includes mobile network operators, satellite communication, and fiber-optic services. At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 0.77% over the past 365 days. It appears that 13 companies in this sub-sector might have seen a positive market cap change, while around 8 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#FREN.JK]PT Smartfren Telecom Tbk[\\#FREN.JK], [#TLKM.JK]PT Telkom Indonesia (Persero) Tbk[\\#TLKM.JK], [#ISAT.JK]PT Indosat Tbk[\\#ISAT.JK], [#EXCL.JK]PT XLSMART Telecom Sejahtera Tbk[\\#EXCL.JK], and [#SUPR.JK]Solusi Tunas Pratama Tbk[\\#SUPR.JK].", "leisure-goods": "The Leisure Goods sector includes products designed for recreation and personal enjoyment, such as sports equipment, gaming consoles, musical instruments, and outdoor activity gear. In Indonesia, this sector is regulated by the Ministry of Tourism and Creative Economy (Kementerian Pariwisata dan Ekonomi Kreatif). Currently, this sub-sector appears to be amidst a bearish trend, marked by an overall market capitalization depreciation of approximately -5.83% over the past 365 days. However, upon closer examination of individual companies, it's evident that more companies are undergoing positive changes (1) in market capitalization compared to those experiencing negative changes (1). This suggests that larger companies with negative changes are exerting significant influence despite more companies having upward trends. Notable companies in this subsector, based on market capitalization, include [#IIKP.JK]Inti Agri Resources Tbk[\\#IIKP.JK], [#BIKE.JK]PT Sepeda Bersama Indonesia Tbk[\\#BIKE.JK], [#UNTD.JK]PT Terang Dunia Internusa Tbk[\\#UNTD.JK], [#DOSS.JK]PT Global Sukses Digital Tbk[\\#DOSS.JK], and [#TOYS.JK]PT Sunindo Adipersada Tbk[\\#TOYS.JK].", "software-it-services": "The Software & IT Services sector develops and provides software applications, IT consulting, cybersecurity solutions, and cloud-based services for businesses and individuals. In Indonesia, this sector is regulated by the Ministry of Communication and Informatics (Kementerian Komunikasi dan Informatika). A well-known non-profit organization in this sector is ICT Watch, which focuses on internet governance, digital rights, and cybersecurity awareness, working to educate the public and advocate for digital safety and inclusion. At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 353.6% over the past 365 days. It appears that 26 companies in this sub-sector might have seen a positive market cap change, while around 6 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#DCII.JK]PT DCI Indonesia Tbk[\\#DCII.JK], [#MLPT.JK]PT Multipolar Technology Tbk[\\#MLPT.JK], [#EMTK.JK]Elang Mahkota Teknologi Tbk[\\#EMTK.JK], [#GOTO.JK]PT GoTo Gojek Tokopedia Tbk[\\#GOTO.JK], and [#BELI.JK]PT Global Digital Niaga Tbk[\\#BELI.JK].", "alternative-energy": "The Alternative Energy sector focuses on the generation and distribution of renewable energy sources such as solar, wind, hydro, and bioenergy. In Indonesia, this sector is regulated by the Ministry of Energy and Mineral Resources (Kementerian Energi dan Sumber Daya Mineral), which oversees renewable energy policies and projects. Additionally, Perusahaan Listrik Negara (PLN), Indonesia's state-owned electricity company, plays a key role in integrating renewable energy into the national grid and expanding the use of sustainable energy sources. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -10.14% over the past 365 days. It's possible that around 1 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 0 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#SEMA.JK]PT Semacom Integrated Tbk[\\#SEMA.JK] and [#JSKY.JK]PT Sky Energy Indonesia Tbk[\\#JSKY.JK].", "oil-gas-coal": "The Oil, Gas & Coal sector in Indonesia is responsible for the exploration, extraction, refining, and distribution of fossil fuels. It is regulated by the Ministry of Energy and Mineral Resources (Kementerian Energi dan Sumber Daya Mineral). A non-profit organization, Indonesian Oil & Gas Society (IATMI), supports energy professionals and promotes sustainable practices in the industry. Indonesia is also one of the largest coal producers in the world, with significant exports to countries like China and India. At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 30.43% over the past 365 days. It appears that 46 companies in this sub-sector might have seen a positive market cap change, while around 34 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#DSSA.JK]Dian Swastatika Sentosa Tbk[\\#DSSA.JK], [#BYAN.JK]Bayan Resources Tbk[\\#BYAN.JK], [#CUAN.JK]PT Petrindo Jaya Kreasi Tbk[\\#CUAN.JK], [#GEMS.JK]Golden Energy Mines Tbk[\\#GEMS.JK], and [#AADI.JK]PT Adaro Andalan Indonesia Tbk[\\#AADI.JK].", "industrial-services": "The Industrial Services sector in Indonesia provides essential support services like maintenance, repair, and operational assistance for industries such as manufacturing, energy, and construction. Regulated by the Ministry of Industry (Kementerian Perindustrian), the sector ensures high standards of safety, efficiency, and sustainability. The Indonesian Industrial Services Association (ASII) plays a key role in advancing technical expertise, promoting best practices, and fostering collaboration within the sector. At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 37.24% over the past 365 days. It appears that 15 companies in this sub-sector might have seen a positive market cap change, while around 5 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#JTPE.JK]Jasuindo Tiga Perkasa Tbk[\\#JTPE.JK], [#ASGR.JK]Astra Graphia Tbk[\\#ASGR.JK], [#TIRA.JK]Tira Austenite Tbk[\\#TIRA.JK], [#MFMI.JK]Multifiling Mitra Indonesia Tbk[\\#MFMI.JK], and [#KONI.JK]Perdana Bangun Pusaka Tbk[\\#KONI.JK].", "industrial-goods": "The Industrial Goods sector is integral to Indonesia’s manufacturing and construction industries, providing machinery, tools, and equipment essential for production and infrastructure projects. Regulated by the Ministry of Industry (Kementerian Perindustrian), it ensures that Indonesia's industrial goods meet both domestic and global demands. The Indonesian Association of Heavy Equipment Manufacturers (IMME) plays a pivotal role in fostering collaboration, technical advancements, and promoting the growth of the heavy equipment industry. At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 25.06% over the past 365 days. It appears that 28 companies in this sub-sector might have seen a positive market cap change, while around 10 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#KPAL.JK]PT Steadfast Marine Tbk[\\#KPAL.JK], [#KRAH.JK]PT Grand Kartech Tbk[\\#KRAH.JK], [#UNTR.JK]United Tractors Tbk[\\#UNTR.JK], [#IMPC.JK]PT Impack Pratama Industri Tbk[\\#IMPC.JK], and [#HEXA.JK]Hexindo Adiperkasa Tbk[\\#HEXA.JK].", "food-beverage": "The Food & Beverage sector in Indonesia focuses on processing, manufacturing, and distributing a wide range of food products and beverages, including key exports like coffee, tea, and palm oil. The sector is regulated by the Ministry of Agriculture (Kementerian Pertanian), which sets food safety standards and ensures quality control. The Indonesian Food and Beverage Association (GAPMMI) supports the sector by promoting innovation, improving industry standards, and facilitating trade for local products At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 25.0% over the past 365 days. It appears that 60 companies in this sub-sector might have seen a positive market cap change, while around 34 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#PANI.JK]PT Pantai Indah Kapuk Dua Tbk[\\#PANI.JK], [#ICBP.JK]Indofood CBP Sukses Makmur Tbk[\\#ICBP.JK], [#CPIN.JK]Charoen Pokphand Indonesia Tbk[\\#CPIN.JK], [#INDF.JK]Indofood Sukses Makmur Tbk[\\#INDF.JK], and [#MYOR.JK]Mayora Indah Tbk[\\#MYOR.JK].", "multi-sector-holdings": "The Multi-sector Holdings sector consists of businesses operating across various industries, managing investments in sectors like banking, manufacturing, real estate, and consumer goods. These companies contribute to diversifying Indonesia's industrial landscape. The industry is regulated by the Financial Services Authority (OJK) and supported by organizations such as the Indonesian Chamber of Commerce and Industry (KADIN Indonesia). At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 7.31% over the past 365 days. It appears that 3 companies in this sub-sector might have seen a positive market cap change, while around 2 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#ASII.JK]Astra International Tbk[\\#ASII.JK], [#BNBR.JK]Bakrie & Brothers Tbk[\\#BNBR.JK], [#BHIT.JK]PT MNC Asia Holding Tbk[\\#BHIT.JK], [#FOLK.JK]PT Multi Garam Utama Tbk[\\#FOLK.JK], and [#ZBRA.JK]PT Dosni Roha Indonesia Tbk[\\#ZBRA.JK].", "automobiles-components": "TThe Automobiles & Components sector covers the manufacturing, assembly, and distribution of vehicles, spare parts, and automotive accessories. In Indonesia, this sector is regulated by the Ministry of Industry (Kementerian Perindustrian). The Indonesian Automotive Industry Association (GAIKINDO), supports the sector by organizing a major annual automotive event, GAIKINDO Indonesia International Auto Show (GIIAS), which spans a full month and showcases the latest innovations and trends in the automotive industry. At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -2.79% over the past 365 days. It's possible that around 9 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 6 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#NIPS.JK]Nipress Tbk[\\#NIPS.JK], [#PRAS.JK]Prima Alloy Steel Universal Tbk[\\#PRAS.JK], [#MASA.JK]Multistrada Arah Sarana Tbk[\\#MASA.JK], [#AUTO.JK]Astra Otoparts Tbk[\\#AUTO.JK], and [#SMSM.JK]Selamat Sempurna Tbk[\\#SMSM.JK].", "holding-investment-companies": "The Holding & Investment Companies sector consists of entities that manage diversified investment portfolios across multiple industries, ensuring financial stability and strategic business expansion in various economic sectors. The industry is regulated by the Financial Services Authority (OJK) and supported by organizations such as the Indonesian Chamber of Commerce and Industry (KADIN Indonesia) and the Indonesian Issuers Association (AEI). At this moment, this sub-sector seems to be experiencing a bullish trend, with a total market cap growth of around 53.87% over the past 365 days. It appears that 15 companies in this sub-sector might have seen a positive market cap change, while around 1 companies could have experienced a negative market cap change. Notable companies in this subsector, based on market capitalization, include [#DNET.JK]PT Indoritel Makmur Internasional Tbk[\\#DNET.JK], [#SMMA.JK]PT Sinar Mas Multiartha Tbk[\\#SMMA.JK], [#CASA.JK]PT Capital Financial Indonesia Tbk[\\#CASA.JK], [#COIN.JK]PT Indokripto Koin Semesta Tbk[\\#COIN.JK], and [#SRTG.JK]PT Saratoga Investama Sedaya Tbk[\\#SRTG.JK].", "banks": "The Banks sector is one of the biggest sectors in Indonesia, it encompasses a wide range of financial institutions, including commercial banks, state-owned banks, and regional banks. The sector is regulated by the Financial Services Authority (OJK - Otoritas Jasa Keuangan), which ensures financial stability, consumer protection, and the integrity of the banking system. Currently, this sub-sector appears to be amidst a bearish trend, marked by an overall market capitalization depreciation of approximately -18.19% over the past 365 days. However, upon closer examination of individual companies, it's evident that more companies are undergoing positive changes (26) in market capitalization compared to those experiencing negative changes (21). This suggests that larger companies with negative changes are exerting significant influence despite more companies having upward trends. Notable companies in this subsector, based on market capitalization, include [#BBCA.JK]PT Bank Central Asia Tbk[\\#BBCA.JK], [#BBRI.JK]PT Bank Rakyat Indonesia (Persero) Tbk[\\#BBRI.JK], [#BMRI.JK]PT Bank Mandiri (Persero) Tbk[\\#BMRI.JK], [#BBNI.JK]PT Bank Negara Indonesia (Persero) Tbk[\\#BBNI.JK], and [#BRIS.JK]PT Bank Syariah Indonesia Tbk[\\#BRIS.JK].", "pharmaceuticals-health-care-research": "The Pharmaceuticals & Health Care Research sector includes the production, distribution, and research of medicines, medical supplies, and healthcare products. The industry is regulated by the National Agency of Drug and Food Control (BPOM) and supported by organizations such as the Indonesian Pharmaceutical Association (IAI) and the Indonesian Medical Association (IDI). At this moment, this sub-sector appears to be in a bearish market sentiment, with a total market cap depreciation of approximately -14.94% over the past 365 days. It's possible that around 7 companies within this sub-sector may have encountered a negative market cap change, while it seems that only about 4 companies might have experienced a positive market cap change, indicating a challenging market environment. Notable companies in this subsector, based on market capitalization, include [#KLBF.JK]Kalbe Farma Tbk[\\#KLBF.JK], [#SIDO.JK]PT Industri Jamu Dan Farmasi Sido Muncul Tbk[\\#SIDO.JK], [#TSPC.JK]Tempo Scan Pacific Tbk[\\#TSPC.JK], [#SOHO.JK]PT Soho Global Health Tbk[\\#SOHO.JK], and [#PYFA.JK]PT Pyridam Farma Tbk[\\#PYFA.JK]."}